[{"id":1,"name":"Dark Chocolate Fig Rolls with Mocha Ganache","summary":"","baker":[{"name":"Elizabeth Davis","hometown":"Wayzata"}],"features":[],"cookie_type":"","year":2018,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For dough:</strong></div>\n<ul>\n<li>1/2 c. (1 stick) butter, at room temperature</li>\n<li>1/4 c. granulated sugar</li>\n<li>1/4 c. packed light brown sugar</li>\n<li>1/4 tsp. baking soda</li>\n<li>1 egg</li>\n<li>1 tsp. vanilla extract</li>\n<li>1/2 tsp. salt</li>\n<li>1 3/4 c. flour, plus extra for rolling dough</li>\n</ul>\n<div><strong>For fig filling:</strong></div>\n<ul>\n<li>1 c. diced dried figs</li>\n<li>1/2 c. finely chopped pitted dates</li>\n<li>1/2 c. freshly squeezed orange juice</li>\n<li>1/3 c. diced candied orange peel (or freshly grated peel from 1 orange; see Note)</li>\n<li>2 tbsp. granulated sugar</li>\n<li>1/4 tsp. ground cinnamon</li>\n<li>1/3 c. finely chopped walnuts</li>\n<li>1 c. dark chocolate chips</li>\n</ul>\n<div><strong>For mocha ganache:</strong></div>\n<ul>\n<li>1 c. dark chocolate chips, divided</li>\n<li>1/2 c. heavy cream</li>\n<li>1 tsp. espresso powder</li>\n</ul>","procedure_clean":"<p><strong>To prepare dough:</strong> In a bowl of an electric mixer on medium-high speed, beat butter for 1 minute. Add granulated sugar, brown sugar and baking soda, and beat until light and fluffy, about 2 minutes. Add egg, vanilla extract and salt and mix until thoroughly incorporated. Reduce speed to low and slowly add flour, mixing until just combined. Divide dough in half, form each half into small rectangles, wrap each rectangle in plastic wrap and refrigerate at least 3 hours.</p>\n<p><strong>To prepare fig filling:</strong> In a small saucepan over medium-high heat, combine figs, dates, orange juice, candied orange peel (or freshly grated orange peel), sugar and cinnamon. Bring to a boil, then reduce heat to medium-low and simmer until mixture is soft and thick, about 5 to 8 minutes. Remove from heat and stir in walnuts. Set aside to cool to room temperature. Once cooled, stir in chocolate chips.</p>\n<p><strong>To assemble cookies:</strong> Preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>Remove dough from refrigerator and allow it to rest for 10 minutes.</p>\n<p>On a lightly floured work surface using a lightly floured rolling pin, roll one of the rectangles into a 10- by- 8-inch rectangle.</p>\n<p>Cut each rectangle into two 10- by 4-inch strips. Portion 1/4 of the filling down the center of each strip. Lift one long side of the dough up and over the filling, and repeat with the opposite side to enclose the filling (fold dough as if folding a business-size letter). Pinch the 2 sides together at the edges. Carefully transfer the roll to the prepared baking sheet, placing them seam side down. Repeat with second strip of dough, then repeat entire process with second rectangle.</p>\n<p>Bake until lightly browned, about 12 minutes. Remove from oven, cool for 2 minutes, then slice each strip into 1-inch pieces, cutting diagonally. Transfer cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare mocha ganache:</strong> Place chocolate chips in a medium bowl. In a small saucepan over medium heat, bring cream to a boil and stir in powdered espresso. Pour cream mixture over 3/4 cup chocolate chips and stir until smooth, adding more chips, if necessary, to reach desired consistency Allow ganache to cool until it has thickened but remains liquid. Using a spoon, pour ganache over cookies, allowing ganache to drip down sides. Place on a wire rack for ganache to set.</p>","notes":"This dough must be prepared in advance. Candied orange peel can be found in the baking aisle of most supermarkets. Substitute the freshly grated peel of 1 orange for candied orange peel. Espresso powder, such as the Medaglia D’oro brand, can be found in the coffee aisle of most supermarkets. From Elizabeth Davis of Wayzata.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/chocolate-fig-rolls.jpg"},{"id":2,"name":"White Chocolate and Cherry Tea Cakes","summary":"A decadent and elegant interpretation of the classic Mexican Wedding Cake cookie.","baker":[{"name":"Teri Laster","hometown":"Bloomington"}],"features":["Chocolate","Fruit","Nut"],"cookie_type":"Drop","year":2018,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>1 c. (2 sticks) unsalted butter, at room temperature</li>\n<li>1/2 c. sifted powdered sugar, plus extra for garnish</li>\n<li>1 tsp. vanilla extract</li>\n<li>1/2 tsp. kosher salt</li>\n<li>2 1/4 c. flour</li>\n<li>1/2 c. finely chopped pecans</li>\n<li>1/2 c. chopped dried cherries</li>\n<li>4 oz. white chocolate, chopped</li>\n</ul>","procedure_clean":"<p>Preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter and powdered sugar until light and fluffy, about 2 minutes. Add vanilla extract and beat until thoroughly combined. Reduce speed to low, add flour and salt, and mix until just combined (dough will seem crumbly). Stir in pecans, cherries and white chocolate.</p>\n<p>Shape dough into 1-inch balls and place 2 inches apart on prepared baking sheets, pressing top of dough slightly. Bake until cookies just set and start to brown, about 9 to 11 minutes. Remove cookies from oven and cool for 5 minutes before transferring to a wire rack to cool completely. When cool, dust with powdered sugar.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/chocolate-cherry-teacakes.jpg"},{"id":3,"name":"Cranberry Pecan Swirls","summary":"Fresh, festive berries taste as good as they look.","baker":[{"name":"Annette Poole","hometown":"Prior Lake, Minnesota"}],"features":["Easy","Fruit","Nut"],"cookie_type":"Refrigerator","year":2012,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>1½ cups flour, plus extra for rolling dough</li>\n<li>¼ teaspoon baking powder</li>\n<li>¼ teaspoon salt</li>\n<li>½ cup butter, at room temperature</li>\n<li>¾ cup sugar</li>\n<li>1 egg</li>\n<li>1 teaspoon vanilla extract</li>\n<li>⅓ cup finely chopped fresh cranberries</li>\n<li>½ cup ground pecans</li>\n<li>1 tablespoon freshly grated orange zest</li>\n</ul>","procedure_clean":"<p>In a medium bowl, whisk together flour, baking powder and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter and sugar until light and fluffy, about 2 minutes. Add egg and vanilla extract, and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>In a small bowl, combine cranberries, pecans and orange zest.</p>\n<p>On a lightly floured work surface, using a lightly floured rolling pin, roll dough to a 10-inch square. Sprinkle cranberry mixture over dough, leaving a ½-inch border on two opposite sides. Roll dough, jelly-roll fashion, beginning at one of the borders and rolling towards the other border. Wrap in plastic wrap and freeze at least 8 hours.</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper. Unwrap dough logs and, using a sharp knife, trim off uneven ends. Cut dough into 1/4-inch thick slices and place cookies (flat side down) 2 inches apart on prepared baking sheets. Bake until lightly browned, 14 to 15 minutes. Remove from oven and cool 2 minutes and transfer cookies to a wire rack to cool completely.</p>","notes":"Taste Tip: This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-180895081.jpg"},{"id":28,"name":"Swedish Shortbread Cookies","summary":"This easy-to-prepare cookie tastes even better than it looks.","baker":[{"name":"Marsha Morrissette","hometown":"Eden Prairie"}],"features":["Easy"],"cookie_type":"Rolled","year":2003,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>½ cup plus 2 tablespoons granulated sugar</li>\n<li>2 to 2 1/3 cups flour</li>\n<li>1/3 cup raspberry jam</li>\n<li>1 cup powdered sugar</li>\n<li>1 teaspoon almond extract</li>\n<li>2 to 3 teaspoons water</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter and granulated sugar until creamy, about 2 minutes. Reduce speed to low and slowly add flour, mixing until just incorporated and adding enough so dough isn't sticky. Divide dough into six balls of equal size, wrap balls in plastic wrap and refrigerate 30 minutes.</p>\n<p>Place a dough ball between two sheets of parchment paper and, using a rolling pin, roll dough to 1/4-inch thickness, forming a 3- by 10-inch rectangle. Carefully peel away top layer of parchment paper.</p>\n<p>Make a shallow crease down long center of rectangle and fill crease with raspberry jam. Repeat with remaining dough. Carefully transfer dough, retaining parchment paper, to baking sheet. Bake 10 to 12 minutes until edges become golden brown. Remove from oven, cool 2 minutes and cut across short side of rectangle at a slight angle, making 6 or so cookies. Transfer cookies to a wire rack to cool completely.</p>\n<p>In a small bowl, whisk together powdered sugar, almond extract and water until smooth. Using a spoon, drizzle glaze across cookies.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377312.jpg"},{"id":4,"name":"Orange Ginger Drops","summary":"Crystallized ginger and citrus spice up a holiday classic.","baker":[{"name":"Cheryl Francke","hometown":"Arden Hills"}],"features":["Easy","Fun with kids"],"cookie_type":"Rolled","year":2012,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<ul>\n<li>2¼ cups flour</li>\n<li>2 teaspoons baking soda</li>\n<li>¼ teaspoon salt</li>\n<li>½ teaspoon ground cloves</li>\n<li>1 teaspoon ground cinnamon</li>\n<li>1 teaspoon ground ginger</li>\n<li>1 tablespoon plus 2 teaspoons freshly grated orange zest, divided</li>\n<li>1 tablespoon chopped crystallized ginger, plus extra for garnish</li>\n<li>¾ cup (1½ sticks) butter, at room temperature</li>\n<li>1 cup packed brown sugar</li>\n<li>1 egg</li>\n<li>¼ cup molasses</li>\n<li>1 tablespoon freshly squeezed orange juice</li>\n<li>3 tablespoons granulated sugar</li>\n</ul>","procedure_clean":"<p>In a large bowl, whisk together flour, baking soda, salt, cloves, cinnamon, ground ginger, 1 tablespoon orange zest and 1 tablespoon crystallized ginger, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter and brown sugar until creamy, about 1 minute. Add egg, molasses and orange juice and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>Meanwhile, in a small bowl, combine remaining 2 teaspoons orange zest with granulated sugar. Using your fingers, blend mixture thoroughly until orange zest has crystallized appearance and texture, and reserve.</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper. Roll dough into 1¼ -inch balls. Dip dough balls in orange zest mixture and place cookies, sugar-side up, 2 inches apart on prepared baking sheets. Press a few pieces of crystallized ginger into sugared top.</p>\n<p>Bake until cookies are set but not hard, 10 to 12 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-180895251.jpg"},{"id":5,"name":"Marzipan Almond Shortbread","summary":"The flavors say \"holiday,\" loud and clear, in this easy-to-prepare treat.","baker":[{"name":"Cynthia Baxter","hometown":"Minneapolis"}],"features":["Easy","Fruit","Nut"],"cookie_type":"Refrigerator","year":2018,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<ul>\n<li>1 c. all-purpose flour</li>\n<li>1/2 c. semolina flour</li>\n<li>1/4 tsp. salt</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>1/4 c. marzipan (about 3 1/2 oz., or 1/2 tube), at room temperature, cut into small pieces (see Note)</li>\n<li>1/3 c. light brown sugar</li>\n<li>1/4 tsp. vanilla extract</li>\n<li>1 tbsp. milk, plus extra for dough</li>\n<li>1/4 c. chopped blanched slivered almonds</li>\n<li>1/2 c. chopped dried tart cherries</li>\n<li>1 egg white</li>\n<li>1 tbsp. water</li>\n<li>1/4 c. turbinado sugar (or granulated sugar, or a decorative sugar)</li>\n</ul>","procedure_clean":"<p>In a medium bowl, whisk together all-purpose flour, semolina flour and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, marzipan and light brown sugar until light and fluffy, about 2 minutes. Add vanilla extract and 1 tablespoon milk and beat until thoroughly combined. Reduce speed to low, add flour mixture in batches, mixing until just combined. (If dough is too crumbly, add additional milk, 1 teaspoon at a time and up to 1 tablespoon, until dough comes together.) Stir in almonds and dried cherries.</p>\n<p>Shape dough into a log about 12 inches in length and about 1 1/2 inches in diameter. Wrap dough log in plastic wrap and refrigerate at least 2 hours (alternatively, freeze for at least 30 minutes).</p>\n<p>When ready to bake, preheat oven to 325 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, whisk egg white and water until slightly foamy. Brush log with egg white mixture. Roll log in turbinado sugar (or granulated sugar, or a decorative sugar) to coat dough. Slice log into 1/4-inch slices and place 2 inches apart on prepared baking sheets. Bake until bottoms are lightly browned, about 18 to 22 minutes. Remove cookies from oven and cool for 2 minutes before transferring to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance. Almond paste can be substituted for marzipan. Dough can be frozen for up to 1 month; remove from freezer about 15 minutes before slicing.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/marzipan-almond-shortbread-thumb.jpg"},{"id":6,"name":"Coffee and Irish-Cream Dreams","summary":"Fans of Bailey's Irish Cream, this is your cookie.","baker":[{"name":"Joanne Holtmeier","hometown":"Edina"}],"features":["Easy"],"cookie_type":"Drop","year":2018,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>2 1/2 c. flour</li>\n<li>2 tbsp. instant coffee powder</li>\n<li>1 1/2 tsp. baking soda</li>\n<li>3/4 tsp. salt</li>\n<li>1/2 tsp. baking powder</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>3/4 c. packed brown sugar</li>\n<li>3/4 c. granulated sugar</li>\n<li>1 egg</li>\n<li>1/2 c. Irish cream liqueur (such as Bailey’s; see Note)</li>\n</ul>\n<div><strong>For glaze:</strong></div>\n<ul>\n<li>2 c. powdered sugar</li>\n<li>2 to 4 tbsp. Irish cream liqueur (such as Bailey’s; see Note)</li>\n<li>Brown and white sprinkles for decorating, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare dough:</strong> In a medium bowl, whisk together flour, instant coffee, baking soda, salt and baking powder, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, brown sugar and granulated sugar until light and fluffy, about 2 minutes. Add egg and Irish cream liqueur and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just combined. Cover with plastic wrap and refrigerate for 30 minutes.</p>\n<p>Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Shape dough into 1-inch balls and place 2 inches apart on prepared baking sheets. Bake until cookies are set and beginning to brown, about 10 to 13 minutes. Remove cookies from oven and cool for 2 minutes before transferring to a wire rack to cool completely.</p>\n<p><strong>To prepare glaze:</strong> In a small bowl, whisk together powdered sugar with 2 tablespoons Irish cream liqueur, adding more as needed (mixture should be thick enough to coat cookies). Frost each cookie with glaze, and decorate with brown and white sprinkles, optional. Place on a wire rack for glaze to set.</p>","notes":"This dough must be prepared in advance. For a less-boozy glaze, substitute milk or cream for half the amount of Irish cream liqueur.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/coffee-irish-cream-thumb.jpg"},{"id":7,"name":"Sugar Plum Doodles","summary":"Mulling spices and plum jam place a festive spin on the snickerdoodle.","baker":[{"name":"Michelle Clark","hometown":"Minneapolis"},{"name":"Seamus Kirwin","hometown":"Minneapolis"}],"features":["Easy","Fruit"],"cookie_type":"Drop","year":2018,"recipe_yield":"Makes 3 to 4 dozen cookies.","ingredients_clean":"<div><strong>For plum filling:</strong></div>\n<ul>\n<li>1 c. plum jam</li>\n<li>1/8 tsp. ground nutmeg</li>\n<li>1/8 tsp. ground cloves</li>\n<li>1/8 tsp. ground ginger</li>\n<li>1/2 tsp. ground cinnamon</li>\n</ul>\n<div><strong>For dough:</strong></div>\n<ul>\n<li>1 tsp. baking soda</li>\n<li>1 tsp. cream of tartar</li>\n<li>1/2 tsp. kosher salt</li>\n<li>1 tsp. ground cinnamon</li>\n<li>2 3/4 c. flour</li>\n<li>1 c. (2 sticks) unsalted butter, at room temperature</li>\n<li>3/4 c. granulated sugar</li>\n<li>1/2 c. light brown sugar</li>\n<li>1 egg</li>\n<li>1 egg yolk</li>\n<li>1 tbsp. vanilla extract</li>\n<li>Decorative sugar</li>\n</ul>\n<div><strong>For cinnamon-sugar mixture:</strong></div>\n<ul>\n<li>1/4 c. granulated sugar</li>\n<li>1 tbsp. ground cinnamon</li>\n</ul>","procedure_clean":"<p><strong>To prepare plum filling:</strong> In a small saucepan over low heat, combine plum jam, nutmeg, cloves, ginger and cinnamon, and cook until liquid (alternatively, combine in a microwave-safe bowl and cook in a microwave oven in a few 15-second bursts). Remove from heat, and reserve.</p>\n<p>To prepare cinnamon-sugar mixture: In a wide, shallow bowl, combine cinnamon and sugar, and reserve.</p>\n<p><strong>To prepare dough:</strong> Preheat oven to 325 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together baking soda, cream of tartar, salt, cinnamon and flour, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, granulated sugar and brown sugar until light and fluffy, about 2 minutes. Add egg, egg yolk and vanilla extract and beat for 1 minute. Reduce speed to low, add flour mixture and mix until just combined.</p>\n<p>Shape dough into 1-inch balls, roll in cinnamon-sugar mixture until coated and place 2 inches apart on prepared baking sheets.</p>\n<p>Bake for 8 minutes. Remove from oven. Using the back of a rounded spoon, make an indent in the center of each cookie. Fill indent with 1 teaspoon plum filling and sprinkle with decorative sugar. Return baking sheet to oven (making sure you have rotated the sheet) and bake until cookies are lightly brown, about an additional 3 to 4 minutes. Remove cookies from oven and cool for 5 minutes before transferring to a wire rack to cool completely.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/sugar-plum-doodles-thumb.jpg"},{"id":8,"name":"German Sour Cream Twists","summary":"An old-fashioned, pastry-like treat that stands out in a crowd.","baker":[{"name":"Rosemary Hall","hometown":"St. Louis Park"}],"features":["International"],"cookie_type":"Rolled","year":2017,"recipe_yield":"Makes about 5 dozen cookies.","ingredients_clean":"<ul>\n<li>3 1/2 c. flour</li>\n<li>1 tsp. salt</li>\n<li>1/2 c. shortening, chilled and cut into small pieces</li>\n<li>1/2 c. (1 stick) unsalted butter, chilled and cut into small pieces</li>\n<li>1 package (1/4 oz.) dry yeast</li>\n<li>3/4 c. sour cream</li>\n<li>1 extra-large egg plus 2 extra-large egg yolks, well beaten</li>\n<li>1 tsp. vanilla extract</li>\n<li>1 c. sugar, divided</li>\n</ul>","procedure_clean":"<p>In a large bowl, whisk together flour and salt. Using a pastry blender, cut in shortening and butter, until mixture resembles coarse meal.</p>\n<p>In a small bowl, dissolve yeast with 2 tablespoons warm water. Add yeast mixture, sour cream, beaten eggs and vanilla extract into flour mixture, stirring until thoroughly combined. Cover bowl with a damp cloth and refrigerate for 2 hours.</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>Remove bowl from refrigerator and divide dough in half, keeping second portion refrigerated while preparing the first. Divide sugar in half.</p>\n<p>On a sugared surface using a rolling pin, roll dough to an 8- by 16-inch rectangle. Working quickly, fold one end in and fold the other end to cover, as with an envelope fold. Sprinkle with sugar. Flip dough over and roll to the same 8- by 16-inch size. Fold again, sprinkle again, roll again. Repeat process a third time.</p>\n<p>Sprinkle more sugar over the rolled dough. Cut into 1- by 4-inch strips. Twist each strip, stretching dough slightly. Repeat process with second half of dough.</p>\n<p>Place twisted strips 2 inches apart on prepared baking sheets and bake until lightly brown, about 10 to 12 minutes. Remove cookies from oven and cool for 2 minutes before transferring to a wire rack to cool completely.</p>\n<p><strong>Variation:</strong> Use flavored sugars, such as vanilla, cinnamon or cardamom, for extra flavor.</p>","notes":"This dough must be prepared in advance and requires extra-large eggs.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/sour-cream-twists-thumb.jpg"},{"id":9,"name":"Limoncello Kisses","summary":"A classic sugar cookie pops with a bright burst of lemon.","baker":[{"name":"Joanne Holtmeier","hometown":"Edina"}],"features":["Easy","Fruit"],"cookie_type":"Rolled","year":2017,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>2 c. flour</li>\n<li>1 tsp. baking powder</li>\n<li>1/2 tsp. salt</li>\n<li>1/4 tsp. baking soda</li>\n<li>1 1/2 c. granulated sugar</li>\n<li>1 tbsp. freshly grated lemon zest</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>1 egg</li>\n<li>1 tsp. vanilla extract</li>\n<li>1 tbsp. freshly squeezed lemon juice</li>\n<li>1/4 c. sour cream</li>\n</ul>\n<div><strong>For frosting:</strong></div>\n<ul>\n<li>2 c. powdered sugar</li>\n<li>3 tbsp. limoncello</li>\n<li>1 tbsp. freshly squeezed lemon juice</li>\n<li>Candied lemon slices, freshly grated lemon zest or sprinkles, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a large bowl, whisk together flour, baking powder, salt and baking soda, and reserve.</p>\n<p>In a medium bowl, combine granulated sugar and lemon zest. Using your fingers, rub zest into sugar until fragrant, about 30 seconds.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add lemon sugar and beat until light and fluffy, about 2 minutes. Add egg, vanilla extract and lemon juice, and beat until thoroughly combined. Reduce speed to low and add the flour mixture by halves, alternating with sour cream, and mix until just combined.</p>\n<p>Shape dough into 1-inch balls and place 2 inches apart on prepared baking sheets. Bake until cookies are just firm and tops barely begin to brown, about 10 to 12 minutes. Remove cookies from oven and cool for 2 minutes before transferring to a wire rack to cool completely.</p>\n<p><strong>To prepare frosting:</strong> In a medium bowl, whisk together powdered sugar, limoncello and lemon juice. Add more powdered sugar or lemon juice, as necessary, to make the frosting spreadable. Top each cookie with the frosting. Place on wire rack for frosting to set. If desired, top each cookie with a candied lemon slice, freshly grated lemon zest or holiday sprinkles.</p>","notes":"Limoncello is an Italian lemon liqueur.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/limoncello-kisses-thumb.jpg"},{"id":10,"name":"Mocha Cappuccino Cookies","summary":"Two kinds of chocolate frosting mean double the indulgence.","baker":[{"name":"Joan Hause","hometown":"Lake Elmo"}],"features":["Easy","Chocolate"],"cookie_type":"Rolled","year":2017,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>2/3 c. unsweetened cocoa powder</li>\n<li>1/2 tsp. salt</li>\n<li>2 tsp. granulated fine-ground espresso or dark roast coffee</li>\n<li>2 c. flour</li>\n<li>1 c. (2 sticks) unsalted butter, at room temperature</li>\n<li>1 1/3 c. granulated sugar</li>\n<li>2 egg yolks</li>\n<li>1/4 c. milk</li>\n<li>2 tsp. vanilla extract</li>\n</ul>\n<div><strong>For the frosting:</strong></div>\n<ul>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>1 1/4 c. powdered sugar</li>\n<li>1 tsp. vanilla extract</li>\n<li>3 oz. white chocolate, melted and cooled slightly </ul>\n<div><strong>For bittersweet chocolate frosting:</strong></div>\n<ul>\n<li>3 oz. bittersweet chocolate, melted and cooled slightly</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a large bowl, whisk together cocoa powder, salt, espresso (or coffee) and flour, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat 1 cup butter until creamy, about 1 minute. Add granulated sugar and beat until light and fluffy, about 2 minutes. Add egg yolks, milk and 2 teaspoons vanilla extract, and beat until thoroughly combined. Reduce speed to low, slowly add flour mixture and mix until just combined.</p>\n<p>Shape dough into 1 1/2-inch balls and place 2 inches apart on prepared baking sheets. Using a wide-bottomed glass, carefully press dough to 1/2-inch thickness before baking. Bake until cookies are set and tops are dry, about 8 to 9 minutes. Remove cookies from oven and cool for 2 minutes before transferring to a wire rack to cool completely.</p>\n<p><strong>To prepare frostings:</strong> In a bowl of an electric mixer on medium-high speed, beat 1/2 cup butter until creamy, about 1 minute. Reduce speed to medium-low and add 1 1/4 cups powdered sugar and 1 teaspoon vanilla extract, and mix until creamy. Remove half the frosting from the bowl and set aside. Add the melted white chocolate to one bowl, and the melted bittersweet chocolate to the other, stirring until thoroughly combined. If either frosting needs to be thicker, add more powdered sugar.</p>\n<p>Using a frosting gun, fill container with alternating spoonfuls of white chocolate and then bittersweet chocolate frosting. Create a white chocolate/bittersweet chocolate swirl on top of each cookie, about 2 teaspoons per cookie; a medium-size star tip works well. If using a pastry bag, there is a coupler that can be used to attach two pastry bags, one for each frosting. The same effect can be made by placing 1 teaspoon of each icing on top of a cookie and swirling frosting with a butter knife.</p>","notes":"This cookie has two types of frosting for added effect.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/mocha-cappuccino-thumb.jpg"},{"id":11,"name":"Chocolate Toffee Cookies","summary":"It's true: toffee improves everything it touches, even cookies.","baker":[{"name":"Bonnie Coffey","hometown":"Pequot Lakes"}],"features":["Easy","Chocolate","Nut"],"cookie_type":"Drop","year":2017,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<ul>\n<li>1/2 c. flour</li>\n<li>1 tsp. baking powder</li>\n<li>1/2 tsp. salt</li>\n<li>1 lb. bittersweet or semisweet chocolate, chopped</li>\n<li>4 tbsp. unsalted butter</li>\n<li>1 3/4 c. packed brown sugar</li>\n<li>4 eggs</li>\n<li>1 tbsp. vanilla extract</li>\n<li>5 (1.4 oz.) chocolate-covered English toffee bars (such as Heath), coarsely chopped, or 7 oz. Heath bits</li>\n<li>1 c. chopped walnuts, toasted (see Note)</li>\n<li>Flaky sea salt for sprinkling, optional</li>\n</ul>","procedure_clean":"<p>In a medium bowl, whisk together flour, baking powder and salt, and reserve.</p>\n<p>In a double boiler over gently simmering water (or in a bowl in a microwave oven), combine chocolate and butter, stirring occasionally, until mixture is melted and smooth. Remove from heat and cool until mixture is lukewarm.</p>\n<p>In a bowl of an electric mixer on medium speed, beat  brown sugar and eggs until thick, about 5 minutes. Reduce speed to low, add chocolate mixture and vanilla extract and mix until well combined. Add flour mixture and mix until just combined. Stir in toffee and walnuts. Cover with plastic wrap and refrigerate for 30 minutes.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Drop dough by heaping tablespoons onto prepared baking sheets, spacing 2 inches apart. Sprinkle each cookie with a pinch of sea salt, if desired. Bake until tops of cookies are dry and cracked but are still soft to the touch, about 12 to 14 minutes; do not overbake. Remove cookies from oven and cool for 2 minutes before transferring to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance. To toast walnuts, place the nuts in a dry skillet over medium heat, and cook, stirring (or shaking the pan frequently) until they just begin to release their fragrance, about 3 to 4 minutes (alternately, preheat oven to 325 degrees, spread the nuts on an ungreased baking sheet and bake, stirring often, for 4 to 6 minutes). Based on a recipe from Bon Appétit magazine on the Smitten Kitchen blog.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/chocolate-toffee-thumb.jpg"},{"id":12,"name":"Cranberry Cornmeal Shortbread Cookies","summary":"The flavors of rosemary and orange add to the festivities.","baker":[{"name":"Mary Martin","hometown":"Minneapolis"}],"features":["Winner","Easy","Fruit"],"cookie_type":"Rolled","year":2017,"recipe_yield":"Makes about 2 1/2 dozen (2-inch rectangle) cookies.","ingredients_clean":"<div><strong>For glaze:</strong></div>\n<ul>\n<li>1/3 c. powdered sugar</li>\n<li>1 tsp. freshly grated orange zest</li>\n<li>2 to 4 tsp. freshly squeezed orange juice</li>\n</ul>\n<div><strong>For cookies:</strong></div>\n<ul>\n<li>1 c. flour, plus extra for rolling dough</li>\n<li>1/4 c. finely ground yellow cornmeal</li>\n<li>3 tbsp. sugar</li>\n<li>1 to 2 tsp. freshly chopped rosemary</li>\n<li>Pinch of cayenne pepper</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>2 to 4 tbsp. chopped dried cranberries</li>\n</ul>","procedure_clean":"<p><strong>To prepare glaze:</strong> In a medium bowl, whisk together powdered sugar, orange zest and 2 teaspoons orange juice, adding more orange juice (a teaspoon at a time) until glaze is slightly runny. Reserve.</p>\n<p><strong>To prepare cookies:</strong> In a large bowl, whisk together flour, cornmeal, sugar, rosemary and cayenne. Using a pastry blender, cut in butter until mixture resembles coarse meal. (You may need to add water, 1/2 teaspoon at a time, to help dough come together). Stir in dried cranberries. Form dough into a disk, wrap in plastic wrap and refrigerate at least 1 hour.</p>\n<p>When ready to bake, preheat oven to 325 degrees and line baking sheets with parchment paper.</p>\n<p>On a lightly floured surface using a lightly floured rolling pin, roll dough to 1/4-inch thickness. Use cookie cutters to cut dough and place cookies 2 inches apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, rerolling and cutting until all dough is used.</p>\n<p>Bake until lightly brown, 21 to 24 minutes. Remove cookies from oven and cool on baking sheets for 5 minutes. Brush cookies with glaze, then transfer cookies to a wire rack to cool completely.</p>\n<p><strong>Variation:</strong> Form dough into a ball (do not refrigerate) and shape into a flat 8-inch circle on prepared baking sheet. Using a sharp knife, score dough into 16 wedges. Poke each wedge at least twice with a fork. Bake as directed. Remove from oven and immediately rescore cookies. Cool and glaze as directed.</p>","notes":"This dough must be prepared in advance. Use more or less rosemary and dried cranberries, according to your preferences.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cormeal-shortbread-thumb.jpg"},{"id":13,"name":"Cherry Almond Turnovers","summary":"The triple threat: Sour cherry, mellow almond and flaky pastry.","baker":[{"name":"Lance Swanson","hometown":"North Branch"}],"features":["Fruit","Nut","International"],"cookie_type":"","year":2012,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For filling</strong></div>\n<ul>½ cup granulated sugar</li>\n<li>2 tablespoons cornstarch</li>\n<li>½ cup cherry juice (preferably the more sour Montmorency type of cherry juice)</li>\n<li>¾ cup minced dried tart cherries</li>\n<li>½ cup grated almond paste</li>\n</ul>\n<div><strong>For dough</strong></div>\n<ul>2 cups flour, frozen, plus extra for rolling dough</li>\n<li>2 rounded tablespoons sugar</li>\n<li>¼ teaspoon salt</li>\n<li>¾ cup (1½ sticks) cold butter, diced</li>\n<li>2 ounces cold cream cheese, cut into ½ -inch pieces</li>\n<li>6 to 7 tablespoons ice water</li>\n<li>1 egg, beaten</li>\n<li>Decorative sugar or granulated sugar, for decoration</li>\n</ul>","procedure_clean":"<p><strong>To prepare filling:</strong> In a small saucepan over high heat, whisk together sugar and cornstarch. Whisk in cherry juice and bring to a boil. Cook until thick, about 1 minute. Remove from heat, transfer filling to a heatproof bowl and cool to room temperature. Fold in cherries and almond paste. Cover with plastic wrap and refrigerate until completely cold, at least 1 hour.</p>\n<p><strong>To prepare dough:</strong> In a food processor fitted with a metal blade, combine flour, sugar and salt, and pulse until combined. Add butter and cream cheese, and pulse until mixture resembles coarse crumbs. Add water, 1 tablespoon at a time, and pulse until dough starts to form marble-size clumps. Press dough into 2 discs, wrap in plastic wrap and refrigerate for 1 hour.</p>\n<p><strong>To assemble cookies:</strong> When ready to bake, preheat oven to 400 degrees and line baking sheets with parchment paper. Working with half the dough at a time, remove dough from refrigerator and allow to stand for 5 minutes.</p>\n<p>On a lightly floured surface, using a lightly floured rolling pin, roll dough to 1/16-inch thickness (dough will be quite elastic). Using a knife or a cookie cutter, cut out 2½-inch squares or circles and place cookies 1 inch apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used.</p>\n<p>Drop 1 teaspoon filling in center of each square. Brush edges of cookies with beaten egg, carefully fold dough over filling to form a triangle and press edges to seal (cookies may be refrigerated at this point until ready to bake). Brush tops of cookies with beaten egg and sprinkle with decorative sugar or granulated sugar.</p>\n<p>Bake until light golden brown, 17 to 19 minutes. Remove from oven, cool 2 minutes and transfer cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-180894761.jpg"},{"id":14,"name":"Cherry Pinwheels","summary":"Festive and tasty, these beauties stand out on a tray, and they're surprisingly easy to prepare.","baker":[{"name":"Pam Hopf","hometown":"Edina"}],"features":["Fruit","Fun with kids"],"cookie_type":"Rolled","year":2016,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<ul>\n<li>2 1/2 cups flour, plus extra for rolling dough</li>\n<li>1/2 teaspoon salt</li>\n<li>3/4 teaspoon ground cardamom</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>4 ounces cream cheese, at room temperature</li>\n<li>1 cup granulated sugar</li>\n<li>1 egg, separated</li>\n<li>1 teaspoon vanilla extract</li>\n<li>1/3 cup cherry preserves</li>\n<li>2 tablespoons decorative sugar</li>\n</ul>","procedure_clean":"<p>In a medium bowl, whisk together flour, salt and cardamom, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, cream cheese and granulated sugar until light and fluffy, about 3 minutes. Add egg yolk and vanilla extract, and beat until thoroughly combined. Reduce speed to low and add flour mixture in 3 batches, mixing just until combined and dough forms. Divide dough into 4 equal pieces, flatten each piece into a block, wrap in plastic wrap and refrigerate until firm, at least 2 to 3 hours.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>On a lightly floured surface using a lightly floured rolling pin, roll dough blocks (1 at a time, keeping remaining dough refrigerated until ready to roll) to 1/4-inch thickness. Working quickly (dough is easiest to work with when chilled), trim edges to make 8- by 12-inch rectangle. Rewrap scraps in plastic and chill, until ready to re-roll.</p>\n<p>Using a pastry wheel, cut rectangle into 2-inch squares. Using a spatula, transfer squares to prepared baking sheets, placing 2 inches apart. With a small knife, carefully make a 1-inch-long cut in 1 square, from tip of each corner in toward center, halving each corner (you will have 8 points). With tip of knife, lift every other point and gently fold into the center (forming a pinwheel), overlapping ends slightly. Press center lightly to form a small well. Brush cookies with a lightly beaten egg white. Place 1/2 teaspoon jam in center and sprinkle with decorative sugar. Repeat process with remaining chilled dough and scrapes.</p>\n<p>Bake until edges are pale and golden, 10 to 15 minutes. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance. Dough can be prepared up to 2 days in advance and refrigerated, or wrapped in plastic wrap and then aluminum foil and frozen for up to a month. From a recipe in Gourmet magazine.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookie2016-pinwheel-thumb.jpg"},{"id":15,"name":"Brandy Cherry Cookies","summary":"This cookie's secret? Brandy-soaked cherries, with a hint of Chinese five-spice powder.","baker":[{"name":"Kathleen Sonsteng","hometown":"Laporte"}],"features":["Easy","Fruit"],"cookie_type":"Drop","year":2016,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>1 cup dried cherries</li>\n<li>1/2 cup brandy</li>\n<li>2 1/2 cups flour, plus extra for dough, if necessary</li>\n<li>1/4 teaspoon salt</li>\n<li>1/2 teaspoon five-spice powder</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>1 cup sugar, divided</li>\n<li>1 egg</li>\n<li>1 egg yolk</li>\n</ul>","procedure_clean":"<p>In a small saucepan over medium heat, combine dried cherries and brandy. When brandy starts to simmer, remove from heat and let stand for 30 minutes. Drain, reserving both cherries and liquid.</p>\n<p>In a medium bowl, whisk together flour, salt and five-spice powder, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until light and fluffy, about 2 minutes. Add 3/4 cup sugar and beat until thoroughly combined, about 1 minute. Add egg, egg yolk and 2 teaspoons of the reserved brandy liquid (discard remaining liquid), and beat until thoroughly combined. Reduce speed to low and add flour mixture, mixing just until combined. Do not overmix (if dough is sticky, add more flour, 1 tablespoon at a time; you need to be able to roll dough into balls in your hands). Stir in drained cherries. Shape dough into 1-inch balls and refrigerate at least 2 hours or overnight.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Place remaining 1/4 cup sugar into a shallow bowl. Roll dough balls in remaining 1/4 cup sugar to coat. Place dough 1 inch apart on prepared baking sheets. Bake until lightly browned and set on the edges, about 10 to 12 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance. Five-spice powder is a blend of equal parts cinnamon, cloves, fennel seed, star anise and Szechuan peppercorns and is available in the spice aisles of most supermarkets. If cherries are large, chop them. From a recipe in Country Home magazine.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookie2016-brandy-thumb.jpg"},{"id":16,"name":"Peanut Stars Sandwich Cookies","summary":"A made-for-dunking sandwich cookie pops with a cool ginger bite.","baker":[{"name":"John Halstrom","hometown":"Minneapolis"},{"name":"Trevor Howe","hometown":"Minneapolis"}],"features":["Nut","Fun with kids"],"cookie_type":"Rolled","year":2012,"recipe_yield":"Makes about 2 dozen sandwich cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>1¼ cups roasted, unsalted peanuts, toasted (see notes)</li>\n<li>¾ cup flour</li>\n<li>1 teaspoon baking soda</li>\n<li>½ teaspoon salt</li>\n<li>3 tablespoons unsalted butter, melted</li>\n<li>½ cup creamy peanut butter</li>\n<li>½ cup granulated sugar</li>\n<li>½ cup packed light brown sugar</li>\n<li>3 tablespoons whole milk</li>\n<li>1 egg</li>\n</ul>\n<div><strong>For filling</strong></div>\n<ul>¾ cup creamy peanut butter</li>\n<li>3 tablespoons unsalted butter</li>\n<li>1 cup powdered sugar</li>\n<li>1 teaspoon peeled and freshly grated ginger</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a food processor, pulse peanuts until finely chopped and they resemble coarse crumbs (alternately, chop peanuts very fine), and reserve.</p>\n<p>In a medium bowl, whisk together flour, baking soda and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, peanut butter, granulated sugar and light brown sugar until smooth, about 2 minutes. Add milk and egg, and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Fold in peanuts. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper. Roll dough into ½-inch balls and place 2 inches apart on prepared baking sheets. Using moistened fingers, gently flatten cookies into 1-inch discs.</p>\n<p>Bake until edges are slightly browned, 10 to 13 minutes. Remove from oven, cool 2 minutes and transfer cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare filling:</strong> Place peanut butter and butter in a small microwave-safe bowl. Cook until mixture is easily stirred, about 30 seconds. Add powdered sugar and ginger and mix until filling is smooth.</p>\n<p><strong>To assemble cookies:</strong> Spread 1 teaspoon filling on the bottom of a cookie. Top with another cookie, bottom side up as if making a sandwich, and gently press cookies together. Repeat until all cookies form sandwiches.</p>","notes":"This dough must be prepared in advance. Shelf-stable peanut butter, such as Jif or Skippy brands, works best, due to its salt and sugar content. Both raw or roasted peanuts are suitable, and both are better when toasted. Place peanuts in a dry skillet over medium heat, and cook, stirring or shaking the pan frequently, until they just begin to release their fragrance, about 4 to 5 minutes (or preheat oven to 325 degrees, spread nuts on an ungreased baking sheet and bake, stirring often, for 5 to 7 minutes). Remove from heat and cool to room temperature.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-180895431.jpg"},{"id":17,"name":"Almond Ricotta Bars","summary":"Kringle lovers — and cream cheese fans — will love these rich, elegant treats.","baker":[{"name":"Karen Cope","hometown":"Minneapolis"}],"features":["Easy","Nut","International"],"cookie_type":"Bar","year":2016,"recipe_yield":"Makes about 4 dozen bar cookies.","ingredients_clean":"<div><strong>For bars:</strong></div>\n<ul>\n<li>2 1/2 cups flour</li>\n<li>1 tablespoon baking powder</li>\n<li>1 teaspoon salt</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature, plus extra for pan</li>\n<li>2 cups granulated sugar</li>\n<li>2 eggs</li>\n<li>2 teaspoons almond extract</li>\n<li>1 teaspoon vanilla extract</li>\n<li>1 (15-ounce) container whole-milk ricotta cheese</li>\n</ul>\n<div><strong>For frosting:</strong></div>\n<ul>\n<li>1/2 cup (1 stick) butter, at room temperature</li>\n<li>4 ounces cream cheese, at room temperature</li>\n<li>3 cups powdered sugar</li>\n<li>1 teaspoon almond extract</li>\n<li>1/2 cup sliced almonds, toasted (see Taste Tip)</li>\n</ul>","procedure_clean":"<p><strong>To prepare bars:</strong> </p>\n<p>Preheat oven to 325 degrees. Butter bottom and sides of a 13- by 18-inch half-sheet pan.</p>\n<p>In a medium bowl, sift together flour, baking powder and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat 2 sticks butter and granulated sugar until light and fluffy, about 3 minutes. Add eggs, one at a time, and beat until thoroughly combined. Add 2 teaspoons almond extract and 1 teaspoon vanilla extract, and beat until thoroughly combined. Reduce speed to low, add ricotta in 3 additions. Gradually add flour mixture and mix until just combined.</p>\n<p>Spread batter in prepared pan and bake until cake is set, lightly golden and the edges start pulling away from sides of pan, about 35 to 45 minutes. Remove from oven and transfer pan to a wire rack to cool completely.</p>\n<p><strong>To prepare frosting:</strong> </p>\n<p>In a bowl of an electric mixer on medium-high speed, beat 1 stick butter and cream cheese until light and fluffy, about 2 minutes. Reduce speed to low, add powdered sugar and 1 teaspoon almond extract, and mix until uniform and creamy. Spread frosting over cooled bar cookies, slice into squares and top squares with toasted almonds.</p>","notes":"To toast almonds, place nuts in a dry skillet over medium heat, and cook, stirring or shaking the pan frequently, until they just begin to release their fragrance, about 2 to 3 minutes (or preheat oven to 325 degrees, spread nuts on an ungreased baking sheet and bake, stirring often, for 4 to 6 minutes). Remove from heat and cool to room temperature.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookie2016-almond-thumb.jpg"},{"id":19,"name":"Royal Sweets With Chocolate-Balsamic Sauce","summary":"2012 Winner: An eye-catching meringue dresses up cookie platters.","baker":[{"name":"Patrice Johnson","hometown":"Roseville"}],"features":["Winner","Chocolate"],"cookie_type":"Drop","year":2012,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>4 egg whites, at room temperature</li>\n<li>⅛ teaspoon cream of tartar</li>\n<li>Pinch of salt</li>\n<li>1 cup superfine sugar</li>\n<li>2 tablespoons unsweetened cocoa powder, sifted or whisked to remove lumps</li>\n</ul>\n<div><strong>For sauce</strong></div>\n<ul>3 ounces dark chocolate</li>\n<li>⅓ cup heavy cream</li>\n<li>¼ cup packed brown sugar</li>\n<li>1 tablespoon balsamic vinegar</li>\n<li>2 tablespoons cold butter</li>\n<li>1 teaspoon vanilla extract</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 250 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl of an electric mixer fitted with a whisk attachment on medium-high speed, beat egg whites, cream of tartar and salt until mixture is foamy. Gradually add sugar and continue beating until egg whites are very stiff and form solid peaks when the whisk is lifted out of the bowl, at least 5 minutes. Using a rubber spatula, carefully fold in cocoa powder.</p>\n<p>Using a pastry bag fitted with a star tip (or a plastic bag, with a corner cut out), fill bag with batter and pipe a basket-shaped circular cookie, 1½ -inches wide and 1½ -inches tall, with a small indented opening in the center (or make a tiny depression in top of cookie with wet finger or back of wet spoon). You could also use a small scoop to drop mounds of batter onto prepared baking sheets and make the indentation on top separately. Repeat with remaining batter.</p>\n<p>Bake until cookies are dry and crisp on the outside but tender on the inside, 50 to 60 minutes. If cookies start to take on any color, reduce heat to 200 degrees. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare sauce:</strong> In small saucepan over low heat, combine chocolate, cream and brown sugar, stirring occasionally until chocolate has melted. Stir in vinegar. Remove from heat, stir in butter until melted. Stir in vanilla extract and cool slightly. Spoon sauce into center of cookies.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-180895521.jpg"},{"id":20,"name":"Pistachio Pinecones","summary":"A simple cut-and-bake formula, dressed up for the holidays with pistachios and white chocolate.","baker":[{"name":"Linda McEwen","hometown":"Mahtomedi"}],"features":["Easy","Chocolate","Nut"],"cookie_type":"Refrigerator","year":2016,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<ul>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>3/4 cup sugar</li>\n<li>1/2 teaspoon vanilla extract</li>\n<li>1/4 teaspoon salt</li>\n<li>1 vanilla bean</li>\n<li>2 cups flour</li>\n<li>2 cups finely chopped salted, dry-roasted pistachios, divided</li>\n<li>12 ounces white chocolate</li>\n<li>1 tablespoon vegetable shortening</li>\n</ul>","procedure_clean":"<p>In a bowl of an electric mixer on medium-high speed, beat butter for 30 seconds. Add sugar, vanilla extract and salt, and beat until just combined, scraping sides of bowl occasionally. Split vanilla bean in half lengthwise. Using the tip of a paring knife, scrape seeds from bean into the butter mixture, and beat until thoroughly combined. Reduce speed to low, add flour in 1/2 cup increments and mix just until combined. Stir in 1 cup of pistachios.</p>\n<p>Divide dough in half and shape each half into logs measuring 1 1/2-inches in diameter, giving log an oval shape (one with distinctive wider and narrower ends) so that cut cookies will resemble pine cone shape. Wrap each log in plastic wrap and refrigerate at least 2 hours or up to 2 days.</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>Using a thin-bladed knife, slice chilled logs into 1/4-inch slices. Place dough slices 1 inch apart on prepared baking sheets. Bake until just firm and browned on the bottoms, about 10 to 12 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p>In a microwave-safe bowl (or in a double-boiler over gently simmering water), melt white chocolate and shortening and stir to combine. Place remaining 2 cups chopped pistachios in a wide bowl. Dip the wider end of each cookie in melted white chocolate (to resemble a pine cone), then dip in the pistachios. Transfer cookies to waxed paper and let stand until set.</p>","notes":"This dough must be prepared in advance. If salted, dry-roasted pistachios are unavailable, toast and salt them yourself. To do so, place nuts in a dry skillet over medium heat, sprinkle with 1/2 teaspoon salt and cook, stirring or shaking the pan frequently, until they just begin to release their fragrance, about 2 to 3 minutes (or preheat oven to 325 degrees, spread nuts on an ungreased baking sheet, sprinkle with 1/2 teaspoon salt and bake, stirring often, for 4 to 6 minutes). Remove from heat and cool to room temperature. From a recipe in Midwest Living magazine.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookie2016-pistachio-thumb.jpg"},{"id":25,"name":"Snowball Clippers","summary":"An easy-to-prepare take on the Mounds bar.","baker":[{"name":"Becky Varone","hometown":"Chaska"}],"features":["Easy"],"cookie_type":"Drop","year":2011,"recipe_yield":"Makes 4 to 6 dozen cookies.","ingredients_clean":"<ul>\n<li>½ cup flour</li>\n<li>¼ teaspoon baking powder</li>\n<li>¾ cup sugar</li>\n<li>⅓ cup sour cream</li>\n<li>2 tablespoons butter, melted</li>\n<li>1 egg white, lightly beaten</li>\n<li>½ teaspoon vanilla extract</li>\n<li>4 cups shredded coconut</li>\n<li>½ cup miniature chocolate chips</li>\n<li>4 ounces semisweet chocolate, melted</li>\n</ul>","procedure_clean":"<p>Preheat oven to 325 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, whisk together flour and baking powder, and reserve. In a bowl of an electric mixer on medium speed, beat sugar, sour cream, butter and egg white until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated.</p>\n<p>Add vanilla extract and coconut, and mix until thoroughly incorporated. Stir in chocolate chips. Shape dough into ¾-inch balls (if dough is sticky, dampen your fingers with water), and place 1 inch apart on prepared baking sheets. Bake just until coconut begins to brown, about 18 to 22 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p>Line baking sheets with wax paper. Dip bottoms of cooled cookies in melted chocolate and place cookies, chocolate-side down, on wax paper. Refrigerate until chocolate sets, about 30 minutes.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-134630793.jpg"},{"id":58,"name":"Sambuca Chocolate Crinkles","summary":"Anise-flavored liqueur puts a grown-up spin on a holiday classic.","baker":[{"name":"Robert Bantle","hometown":"St. Paul"}],"features":["Chocolate"],"cookie_type":"Drop","year":2006,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<ul>\n<li>12 ounces bittersweet chocolate</li>\n<li>1 tablespoon butter</li>\n<li>3 eggs</li>\n<li>¼ cup Sambuca Black (see note)</li>\n<li>1 cup granulated sugar, divided</li>\n<li>1 cup raw almonds, finely chopped</li>\n<li>⅔ cup flour</li>\n<li>¾ teaspoon baking soda</li>\n<li>⅓ cup powdered sugar</li>\n</ul>","procedure_clean":"<p>In a double boiler over gently simmering water (or in a microwave oven), melt chocolate and butter, stirring to combine. Remove from heat and cool slightly.</p>\n<p>In a large bowl, whisk together eggs, Sambuca Black and ½ cup granulated sugar. Add chocolate mixture and whisk until combined. Using a spatula, fold in almonds, flour and baking soda until combined; dough will be soft and sticky. Cover bowl with plastic wrap and refrigerate for at least 4 hours or up to 24 hours.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, combine remaining ½ cup granulated sugar and powdered sugar. With slightly wet fingers, roll teaspoon-size balls of dough and roll them in sugar mixture. Place cookies 2 inches apart on prepared baking sheets and bake until cookies are puffed, cracked and just set, 10 to 12 minutes. Remove from oven and cool completely on baking sheets.</p>","notes":"This dough must be prepared in advance. Sambuca Black is an anise-flavored liqueur.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377987.jpg"},{"id":21,"name":"Chocolate-Drizzled Churros","summary":"A festive, spritz-inspired version of the Mexican treat.","baker":[{"name":"Lance Swanson","hometown":"North Branch"}],"features":["Chocolate","International"],"cookie_type":"Drop","year":2011,"recipe_yield":"Makes 5 to 6 dozen cookies.","ingredients_clean":"<ul>\n<li>½ cup plus 2/3 cup sugar, divided</li>\n<li>2½ teaspoons ground cinnamon, divided</li>\n<li>2½ cups flour</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>3 egg yolks, at room temperature</li>\n<li>1½ teaspoons vanilla extract</li>\n<li>3.15 ounces Mexican chocolate, chopped (see Taste Tip)</li>\n<li>1 tablespoon heavy cream or half-and-half</li>\n</ul>","procedure_clean":"<p>Preheat oven to 400 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, combine ½ cup sugar and 1½ teaspoons cinnamon, and reserve. In a medium bowl, whisk together flour, salt and remaining 1 teaspoon cinnamon, and reserve.</p>\n<p>In a bowl of an electric mixer on medium speed, beat butter until creamy, about 1 minute. Add remaining 2/3 cup sugar and beat until light and fluffy, about 2 minutes. Add egg yolks and vanilla extract and beat until thoroughly incorporated. Reduce speed to low, add flour mixture and mix until just incorporated.</p>\n<p>Transfer dough to a pastry bag (or cookie press) fitted with a star or ribbon die and pipe 3-inch long sticks, 1 inch apart, onto prepared baking sheets. Bake until lightly browned, 9 to 11 minutes.</p>\n<p>Remove from oven and cool 2 minutes before transferring cookies a wire rack until they are cool to the touch. Carefully dredge cookies in sugar-cinnamon mixture and return cookies to wire rack to cool completely.</p>\n<p>In a double boiler over gently simmering water, melt chocolate and cream (or half-and-half), stirring occasionally until chocolate is melted and smooth (if using Mexican chocolate, mixture will be grainy). Transfer chocolate to a pastry bag fitted with a small plain tip (or a plastic sandwich bag with one corner removed with a small cut). Drizzle chocolate over each cookie. Allow chocolate to set before serving.</p>","notes":"A recommended chocolate is Abuelita chocolate tablets, which are available at most Mexican supermarkets and specialty food shops. Semisweet chocolate can be substituted.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-134630258.jpg"},{"id":23,"name":"Nut Goodie Thumbprints","summary":"Our 2016 winner is a delicious, make-it-yourself tribute to the legendary made-in-Minnesota candy bar.","baker":[{"name":"Crystal Schlueter","hometown":"Babbitt"}],"features":["Winner","Chocolate","Nut","Fun with kids"],"cookie_type":"Drop","year":2016,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>1 cup flour</li>\n<li>1/3 cup unsweetened cocoa powder</li>\n<li>1/4 teaspoon salt</li>\n<li>1/2 cup (1 stick) unsalted butter, at room temperature</li>\n<li>2/3 cup packed light brown sugar</li>\n<li>1 egg, separated</li>\n<li>2 tablespoons whole milk</li>\n<li>2 teaspoons vanilla extract</li>\n<li>3/4 cup chopped roasted and salted peanuts</li>\n</ul>\n<div><strong>For filling:</strong></div>\n<ul>\n<li>2 tablespoons unsalted butter, at room temperature</li>\n<li>2 tablespoons sweetened condensed milk</li>\n<li>1 teaspoon maple extract</li>\n<li>1/2 teaspoon vanilla extract</li>\n<li>1 1/2 teaspoons whole milk</li>\n<li>1 cup powdered sugar</li>\n</ul>\n<div><strong>For ganache:</strong></div>\n<ul>\n<li>1/2 cup semisweet chocolate chips</li>\n<li>2 tablespoons heavy cream</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> </p>\n<p>In a medium bowl, whisk together flour, cocoa powder and salt, and reserve.</p>\n<p>In a bowl of a mixer on medium-high speed, beat together butter and brown sugar until light and fluffy, about 2 minutes. Add egg yolk, 2 tablespoons milk and vanilla extract, and beat until thoroughly combined. Reduce speed to low, gradually add flour mixture and mix just until combined. Form dough into a disk, wrap in plastic wrap and refrigerate at least 30 minutes.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Shape dough into 1-inch balls. Dip the top half of each ball into remaining egg white and then into peanuts. Place dough, peanuts-side up, 2 inches apart on prepared baking sheets. Using the back of a spoon or your thumb, press an indentation into the center of the top of each cookie. Bake until cookies are set but still soft, about 10 to 12 minutes. Remove from oven and carefully remake the same slight indentation into the top of each cookie. Cool for 5 minutes before transferring cookies to a wire rack to cool.</p>\n<p><strong>To prepare filling:</strong> </p>\n<p>In a bowl of an electric mixer on medium speed, combine butter, condensed milk, maple extract, vanilla extract, 1 1/2 teaspoons whole milk and powdered sugar, and beat until uniform and creamy. While cookies are still slightly warm, spoon filling into indentation in cookies, then allow them to cool completely.</p>\n<p><strong>To prepare ganache:</strong> </p>\n<p>Combine chocolate and cream in a microwave-safe bowl (or in a double-boiler over gently simmering water). Cook mixture, stirring occasionally, until fully melted. Stir until smooth. Use the tines of a fork to drizzle chocolate over cooled cookies. Allow ganache to set before serving.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookie2016-goodie-thumb.jpg"},{"id":24,"name":"Lemon-Lime Christmas Trees","summary":"The beloved cookie-cutter cookie gets a fresh citrus kiss.","baker":[{"name":"Joan Hause","hometown":"Lake Elmo"}],"features":["Fun with kids"],"cookie_type":"Rolled","year":2011,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>3¾ cups flour, plus extra for rolling dough</li>\n<li>1 teaspoon baking powder</li>\n<li>1 teaspoon baking soda</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>1½ cups granulated sugar</li>\n<li>2 eggs</li>\n<li>2 tablespoons freshly squeezed lemon juice</li>\n<li>2 teaspoons lemon extract</li>\n<li>1 teaspoon yellow food coloring, optional</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>3 ounces cream cheese, at room temperature</li>\n<li>3 tablespoons unsalted butter, at room temperature</li>\n<li>2 cups powdered sugar</li>\n<li>½ teaspoon freshly grated lime zest</li>\n<li>1 tablespoon freshly squeezed lime juice</li>\n<li>1 teaspoon green food coloring</li>\n<li>Decorative sugar, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a large bowl, whisk together flour, baking powder, baking soda and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium speed, beat 2 sticks butter until creamy, about 1 minute. Add granulated sugar and beat until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition. Add lemon juice, lemon extract and yellow food coloring, if desired, and beat until thoroughly incorporated. Reduce speed to low, add flour mixture and mix until just incorporated. Form dough into two discs, wrap in plastic wrap and refrigerate at least 2 hours.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>On a lightly floured surface, using a lightly floured rolling pin, roll out dough to 1/4-inch thickness. Using a tree cookie cutter, cut out dough and place 2 inches apart on prepared baking sheets.</p>\n<p>Repeat with remaining dough, gathering up scraps, re-rolling and re-cutting dough until all is used. Bake until cookies are set but not hard, 9 to 10 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium speed, beat cream cheese and butter until creamy, about 1 minute. Reduce speed to low, add powdered sugar and mix until creamy, about 2 minutes. Add lime zest, lime juice and food coloring, and mix until thoroughly incorporated. Ice cookies, and decorate with colored sugar, if desired.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-134630538.jpg"},{"id":72,"name":"Bacon Cornmeal Venetos","summary":"An usual combination of salty and sweet accents.","baker":[{"name":"Julie Bollmann","hometown":"Chanhassen"},{"name":"Wendy Kleiser","hometown":"Minneapolis"},{"name":"Joan Koller","hometown":"Jordan"},{"name":"Geri Olson","hometown":"Shoreview"},{"name":"Mary Urbas","hometown":"Woodbury"}],"features":["International"],"cookie_type":"Drop","year":2015,"recipe_yield":"Makes about 3 to 4 dozen cookies.","ingredients_clean":"<div><strong>For cookie:</strong></div>\n<ul>\n<li>3/4 c. golden raisins</li>\n<li>4 bacon strips, cooked and chopped into small pieces, about 1/2 c.</li>\n<li>1 c. finely ground yellow corn meal</li>\n<li>1 1/2 c. flour</li>\n<li>1 1/2 tsp. baking powder</li>\n<li>Pinch of salt</li>\n<li>1 c. (2 sticks) unsalted butter, at room temperature</li>\n<li>6 tbsp. pure maple syrup (Grade B preferred)</li>\n<li>2 eggs</li>\n<li>1 tsp. vanilla extract</li>\n</ul>\n<div><strong>For glaze:</strong></div>\n<ul>\n<li>1 c. powdered sugar</li>\n<li>1/4 tsp. imitation maple flavoring (see Note)</li>\n<li>1 tbsp. unsalted butter</li>\n<li>2 tbsp. milk</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, cover raisins with warm water and soak for 15 minutes. Strain, reserving raisins.</p>\n<p>In a medium bowl, whisk together cornmeal, flour, baking powder and salt.</p>\n<p>In a bowl of an electric mixer on medium-high speed, cream 1 cup butter and maple syrup until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition. Add vanilla extract and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Stir in raisins and bacon.</p>\n<p>Shape dough into 1-inch balls. Place dough 2 inches apart on prepared baking sheets. Bake until golden brown on the edges, about 10 minutes. Remove from oven, cool 2 minutes and transfer cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare glaze:</strong> In a saucepan over medium heat, melt 1 tablespoon butter and cook until butter turns brown; do not burn. Remove from heat. Add powdered sugar, maple flavoring and milk, and whisk until glaze is smooth and a single consistent color. Drizzle glaze on cooled cookies.</p>","notes":"For the “Venetos” name, the cookie is “a modern twist on a classic cookie recipe which originated in the Veneto region of Italy,” wrote Bollmann. Imitation maple flavoring is used in the frosting to bump up its flavor. Use the real thing with the cookies, though.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-360043491.jpg"},{"id":30,"name":"Alfajores","summary":"2004 winner: A South American favorite becomes a holiday favorite.","baker":[{"name":"Graciela Cuadrado-Vielguth","hometown":"Minneapolis"}],"features":["Winner","International","Fun with kids"],"cookie_type":"","year":2004,"recipe_yield":"Makes about 5 dozen sandwich cookies.","ingredients_clean":"<ul>\n<li>½ cup flour, plus extra for rolling dough</li>\n<li>1¼ cups cornstarch (see Taste Tip)</li>\n<li>1 teaspoon baking powder</li>\n<li>½ cup (1 stick) unsalted butter, at room temperature</li>\n<li>¾ cup sugar</li>\n<li>1 egg</li>\n<li>1 egg yolk</li>\n<li>Freshly grated zest of ½ lemon</li>\n<li>1 (13.4-ounce) can dulce de leche (see Taste Tip)</li>\n<li>1½ cups coconut flakes, preferably unsweetened and desiccated (see note)</li>\n</ul>","procedure_clean":"<p>Directions</p>\n<p><strong>To prepare dough:</strong> In a medium bowl, sift together flour, cornstarch and baking powder, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Gradually add sugar and beat until light and fluffy, about 2 minutes. Add egg and egg yolk and beat until thoroughly combined. Add lemon zest and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Cover with plastic wrap and refrigerate at least 2 hours.</p>\n<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>On a lightly floured surface using a floured rolling pin, roll out dough to 3/16-inch thickness. Using a cookie cutter, cut dough in rounds of desired size (between 1 and 2 inches) and place cookies 2 inches apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used. Bake 11 to 12 minutes, making sure cookies do not brown. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely. (Cookies may be stored up to a week in an airtight container until ready to assemble).</p>\n<p><strong>To assemble cookies:</strong> Spread ½ teaspoon dulce de leche (more for larger cookies) into center of bottom of a cookie. Top with another cookie, bottom side up, as if making a sandwich. Spread a very thin layer of dulce de leche onto sandwich edge, and roll edge in coconut flakes. Repeat until all cookies form sandwiches.</p>","notes":"This dough must be prepared in advance. The large amount of cornstarch is correct. Dulce de leche (also called cajeta and manjar) is a thick caramel made from sweetened condensed milk. It can be purchased in the international foods aisles of many supermarkets; one brand name is La Lechera. Unsweetened, desiccated (dried) flaked coconut can be purchased at most natural foods co-ops. This is a traditional (pronounced al-fa-HOR-es) in the contestant’s native Uruguay and found all over South America.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377307.jpg"},{"id":27,"name":"Swedish Almond-Chocolate Macaroons","summary":"2011 winner: This delight has a cocoa buttercream surprise.","baker":[{"name":"Beth Jones","hometown":"Owatonna"}],"features":["Winner","Chocolate","Nut"],"cookie_type":"Drop","year":2011,"recipe_yield":"Makes 2 to 3 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>2 (7-ounce) tubes almond paste, cut into small pieces</li>\n<li>2 egg whites</li>\n<li>½ cup granulated sugar</li>\n</ul>\n<div><strong>For filling</strong></div>\n<ul>1 cup (2 sticks) butter, at room temperature</li>\n<li>1 cup powdered sugar</li>\n<li>2 teaspoons vanilla extract</li>\n<li>2 pasteurized egg yolks (see Taste Tip)</li>\n<li>4 teaspoons unsweetened cocoa powder</li>\n</ul>\n<div><strong>For chocolate coating</strong></div>\n<ul>10 to 12 ounces dark or bittersweet chocolate</li>\n<li>2 to 4 teaspoons vegetable oil or melted butter</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a bowl of an electric mixer on medium speed, beat almond paste and egg whites until thoroughly combined, about 2 minutes, scraping down sides of bowl as necessary. Cover bowl with plastic wrap and refrigerate at least 30 minutes.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Using a small scoop, form dough into balls (or drop by heaping teaspoons) and place 2 inches apart on prepared baking sheets. Moisten the flat bottom of a glass with water, dip into granulated sugar and carefully press prepared glass bottom into dough balls, flattening dough; repeat with remaining dough. Bake until lightly brown, 18 to 20 minutes. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare filling:</strong> Line baking sheets with wax paper.</p>\n<p>In a bowl of an electric mixer on medium speed, beat butter until creamy, about 1 minute. Add powdered sugar, vanilla extract, egg yolks and cocoa powder, and mix until smooth (scraping down sides of bowl as necessary), about 2 minutes. Using a small knife, spread about 1 tablespoon filling on top of each cookie, making a rounded top. Transfer cookies to prepared baking sheets and refrigerate for at least 1 hour.</p>\n<p><strong>To prepare chocolate coating:</strong> Break chocolate into small pieces. In a double boiler over gently simmering water (or in a microwave oven), melt chocolate. Whisk in 2 teaspoons vegetable oil (or melted butter), adding more to reach desired consistency. Let mixture cool for a few minutes, then dip tops of cookies into chocolate mixture, holding onto almond base. Return cookies to prepared baking sheets and refrigerate until chocolate hardens, at least 30 minutes. Store in refrigerator and serve chilled.</p>","notes":"This dough must be prepared in advance. Pasteurized eggs are recommended for food safety reasons. The Swedish cookies are also known as Choklad Biskvier.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-134629998.jpg"},{"id":29,"name":"Almond Palmiers","summary":"Elegant looks mask an easy-to-prepare recipe.","baker":[{"name":"Kay Lieberherr","hometown":"St. Paul"}],"features":["Easy","Nut"],"cookie_type":"Refrigerator","year":2011,"recipe_yield":"Makes 2 to 3 dozen cookies.","ingredients_clean":"<ul>\n<li>4 tablespoons (½ stick) unsalted butter, at room temperature</li>\n<li>¼ cup powdered sugar, plus extra for garnish, optional</li>\n<li>1 (7-ounce) tube almond paste, cut into small pieces</li>\n<li>1 egg</li>\n<li>½ teaspoon almond extract</li>\n<li>¼ cup granulated sugar, divided</li>\n<li>1 (17.3-ounce) package puff pastry sheets (containing 2 sheets), refrigerated</li>\n</ul>","procedure_clean":"<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add powdered sugar and almond paste. Beat until creamy, about 1 minute. Add egg and almond extract, and beat until thoroughly combined.</p>\n<p>Sprinkle work surface with 1 tablespoon granulated sugar. Carefully unfold 1 puff pastry sheet over sugar and sprinkle with 1 tablespoon granulated sugar. Using a rolling pin, roll puff pastry sheet into a 12-inch square. Divide almond paste mixture in half. Carefully spread half of almond paste mixture evenly over top of puff pastry sheet. Starting on both sides, roll opposite sides of puff pastry sheet, from the outer edge to the middle, with rolls meeting in the center. Firmly press together, wrap in plastic wrap and refrigerate at least 2 hours and up to 2 days. Repeat with second puff pastry sheet.</p>\n<p>When ready to bake, preheat oven to 400 degrees and line baking sheets with parchment paper.</p>\n<p>Unwrap puff pastry logs and, using a sharp knife, trim off uneven ends. Cut dough into 1/4-inch slices and place (flat side down) 2 inches apart on prepared baking sheets. Bake until golden brown, 12 to 14 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely. Dust with powdered sugar, if desired, and serve.</p>","notes":"This recipe must be prepared in advance. Palmiers (pronounced pahlm-YAYs) go by many other names, including elephant ears, palm leaves and French hearts.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-134631058.jpg"},{"id":26,"name":"Chocolate-dipped Triple Coconut Haystacks","summary":"Three kinds of coconut give this macaroon three times the flavor.","baker":[{"name":"Ron Traxinger","hometown":"St. Louis Park"}],"features":["Chocolate"],"cookie_type":"","year":2003,"recipe_yield":"Makes 2 dozen cookies","ingredients_clean":"<ul>\n<li>1 cup coconut milk (not cream of coconut)</li>\n<li>¼ cup sugar</li>\n<li>2 tablespoons light corn syrup</li>\n<li>4 egg whites</li>\n<li>2 teaspoons vanilla extract</li>\n<li>½ teaspoon salt</li>\n<li>3 cups unsweetened, shredded, desiccated (dried) coconut (notes)</li>\n<li>3 cups sweetened flaked or shredded coconut</li>\n<li>14 ounces semisweet chocolate</li>\n</ul>","procedure_clean":"<p>Preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together coconut milk, sugar, corn syrup, egg whites, vanilla extract and salt. In a large bowl, combine unsweetened and sweetened coconut, breaking apart any lumps. Pour coconut milk mixture into coconut and mix until coconut is evenly moistened. Refrigerate for 15 minutes.</p>\n<p>Drop heaping tablespoons of batter 1 inch apart on prepared baking sheets. Form cookies into four-sided haystacks, moistening fingers with water if necessary. Bake until light-golden brown, about 15 minutes. Remove from oven and cool 3 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p>In a double boiler over gently simmer water, melt chocolate, stirring occasionally until smooth. Holding haystack by pointed top, carefully dip bottom of cookie into chocolate, covering up to one-third of sides of cookie. Use chopsticks or a fork to remove cookie, draining off excess chocolate. Set on a wire rack over wax paper and refrigerate until chocolate sets, about 15 minutes.</p>","notes":"For extra flavor, add lightly roasted, roughly chopped macadamia nuts (about ¾ cup) into the final coconut mixture, dropping cookies into mounds rather than forming pyramids. Unsweetened, desiccated (dried) flaked coconut can be purchased at most natural foods co-ops.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377192.jpg"},{"id":33,"name":"Cardamom Crescents","summary":"Cardamom spices up a great-looking biscotti-style cookie.","baker":[{"name":"Leslie Smith","hometown":"Minneapolis"}],"features":["Nut","International"],"cookie_type":"","year":2004,"recipe_yield":"Makes about 5 dozen cookies.","ingredients_clean":"<ul>\n<li>1 teaspoon instant coffee</li>\n<li>1 teaspoon ground cardamom</li>\n<li>½ teaspoon baking powder</li>\n<li>1¾ cups flour</li>\n<li>½ cup (1 stick) unsalted butter, at room temperature</li>\n<li>1 cup sugar</li>\n<li>1 cup finely ground hazelnuts or blanched almonds</li>\n<li>2 eggs</li>\n<li>1 cup semisweet chocolate chips</li>\n<li>1 cup finely chopped hazelnuts or blanched almonds</li>\n</ul>","procedure_clean":"<p><strong>To prepare dough:</strong> In a medium bowl, whisk together instant coffee, cardamom, baking powder and flour, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes. Add ground hazelnuts or almonds and beat until thoroughly combined. Add eggs, 1 at a time, beating well after each addition. Reduce speed to low, add flour mixture and mix until just incorporated. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p><strong>To prepare cookies:</strong> When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper. Form rounded teaspoonfuls of dough into 2-inch crescent shapes. Place crescents 1 inch apart on prepared baking sheets. Bake until edges are golden brown, 12 to 15 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To decorate cookies:</strong> In a double boiler over gently simmering water, melt chocolate and stir until very smooth. Quickly dip one end of each crescent into chocolate, and then into chopped nuts. Transfer cookies to wire racks over wax paper and cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377592.jpg"},{"id":31,"name":"Cashew-Lemon Shortbread","summary":"This non-chocolate entry is a guaranteed grab-and-gobble.","baker":[{"name":"Jean Livingood","hometown":"Detroit Lakes"}],"features":["Easy","Fruit","Nut"],"cookie_type":"","year":2004,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>1 cup (2 sticks) butter, at room temperature</li>\n<li>½ cup sugar</li>\n<li>1 teaspoon lemon extract (or 1 teaspoon freshly squeezed lemon juice )</li>\n<li>1 teaspoon vanilla extract</li>\n<li>2 cups flour</li>\n<li>½ cup roasted cashews, chopped</li>\n<li>Additional sugar for dough</li>\n<li>Freshly grated lemon zest, optional</li>\n</ul>","procedure_clean":"<p>Preheat oven to 325 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Gradually add sugar and beat until light and fluffy, about 2 minutes. Add lemon extract (or lemon juice and lemon zest) and vanilla extract, and beat until thoroughly combined. Reduce speed to low, add flour and mix just until dough begins to form a ball. Stir in cashews.</p>\n<p>Shape dough into 1½ -inch balls. Roll dough balls in additional sugar, place 2 inches apart on prepared baking sheets and flatten with bottom of a glass (and sprinkle with a bit of fresh lemon zest if desired). Bake just until cookies are set and edges are lightly browned, 17 to 19 minutes. Remove from oven and cool for 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377597.jpg"},{"id":36,"name":"Devil's Delight Cookies","summary":"2005 Winner: Chocolate, cinnamon and cayenne conspire to make a devilishly good cookie.","baker":[{"name":"Michelle Clark","hometown":"Minneapolis"}],"features":["Winner","Chocolate"],"cookie_type":"Drop","year":2005,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For dough</strong></div>\n<ul>10 ounces bittersweet chocolate, chopped</li>\n<li>½ cup plus 2 teaspoons flour</li>\n<li>3 tablespoons unsweetened cocoa powder</li>\n<li>¼ teaspoon baking powder</li>\n<li>¼ teaspoon cayenne pepper</li>\n<li>¼ teaspoon salt</li>\n<li>5 tablespoons unsalted butter, at room temperature</li>\n<li>1 cup plus 1 tablespoon sugar</li>\n<li>3 eggs</li>\n<li>2 teaspoons vanilla extract</li>\n<li>1 (3.3-ounce) Vosges Red Fire chocolate bar, chopped (see note)</li>\n<li>½ cup (3 ounces) cinnamon chips</li>\n</ul>\n<div><strong>For dusting</strong></div>\n<ul>4 teaspoons sugar</li>\n<li>4 teaspoons ground cinnamon</li>\n<li>1/8 teaspoon cayenne pepper</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a double boiler over gently simmering water, melt bittersweet chocolate until smooth. Remove from heat and cool melted chocolate for 10 minutes.</p>\n<p>In a medium bowl, whisk together flour, cocoa powder, baking powder, cayenne pepper and salt, and reserve. In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition. Continue to beat until mixture is pale, light and creamy, about 5 minutes. Reduce speed to low, add lukewarm melted chocolate and vanilla extract, and mix until just combined. Using a spatula, fold in flour mixture, and then fold in chopped chocolate bar and cinnamon chips.</p>\n<p>In a small bowl, whisk together sugar, cinnamon and cayenne pepper.</p>\n<p>Drop batter by ¼ cupfuls onto prepared baking sheets, spacing cookies 2 inches apart. Sprinkle a pinch of dusting mixture over each cookie and bake until tops are evenly cracked but cookies are not yet firm to the touch, about 16 minutes. Remove from oven and cool cookies completely on baking sheets.</p>","notes":"Vosges chocolate bars are available at Whole Foods Market and other specialty stores and at www.vosgeschocolate.com.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377502.jpg"},{"id":40,"name":"Lime Coolers","summary":"An uncommon holiday flavor -- lime -- makes for an uncommonly delicious cookie.","baker":[{"name":"Stacy McNabb","hometown":"Richfield"}],"features":["Fruit"],"cookie_type":"Drop","year":2007,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>1 cup (2 sticks) butter, at room temperature, plus extra for press</li>\n<li>½ cup powdered sugar</li>\n<li>1¾ cups flour</li>\n<li>¼ cup cornstarch</li>\n<li>1 tablespoon finely grated lime zest</li>\n<li>½ teaspoon vanilla extract</li>\n<li>Granulated sugar for press</li>\n</ul>\n<div><strong>For lime glaze</strong></div>\n<ul>½ cup powdered sugar</li>\n<li>2 to 3 teaspoons finely grated lime zest</li>\n<li>4 teaspoons freshly squeezed lime juice</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add powdered sugar and beat until light and fluffy, about 2 minutes. Reduce speed to low and add flour, cornstarch, lime zest and vanilla extract, and mix until just incorporated. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Shape dough into 1-inch balls and place about 2 inches apart on prepared baking sheets. Grease bottom of a large flat glass with butter, press into granulated sugar and gently press glass on dough until dough is about ¼-inch thick. Repeat, pressing glass into sugar each time, until all cookies are flattened. Bake until edges are light golden brown, 9 to 11 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare lime glaze:</strong> In a small bowl, whisk together powdered sugar, lime zest and lime juice until a light glaze forms. Using a knife, spread glaze across cookies.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/limecooler2007.jpg"},{"id":43,"name":"Chai Crescents","summary":"A delicate-as-pie-crust cookie with a contemporary spin.","baker":[{"name":"Lisa Osacho","hometown":"Eden Prarie"}],"features":["International","Nut"],"cookie_type":"Drop","year":2007,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>½ cup (1 stick) unsalted butter, at room temperature</li>\n<li>3 tablespoons granulated sugar</li>\n<li>1 cup flour, plus extra for rolling dough</li>\n<li>1 teaspoon vanilla extract</li>\n<li>Pinch of salt</li>\n<li>½ cup finely chopped toasted pecans or walnuts</li>\n</ul>\n<div><strong>For chai spice blend</strong></div>\n<ul>¼ teaspoon ground cloves</li>\n<li>½ teaspoon ground cardamom</li>\n<li>½ teaspoon ground ginger</li>\n<li>¼ teaspoon ground white pepper</li>\n<li>½ teaspoon ground cinnamon</li>\n<li>&#8532; cup superfine sugar</li>\n<li>Flour for rolling dough</li>\n</ul>","procedure_clean":"<p>In a food processor fitted with a metal blade, combine butter, sugar, flour, vanilla extract and salt, and pulse until combined. Transfer dough to a large bowl and stir in chopped nuts. Cover with plastic wrap and refrigerate at least 4 hours or overnight.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, whisk together cloves, cardamom, ginger, white pepper, cinnamon and superfine sugar, and reserve. Remove dough from refrigerator and soften 20 to 30 minutes. Form dough into 1-inch balls.</p>\n<p>On a lightly floured board, roll dough balls until dough is shaped into finger-size sticks. Shape sticks into crescents, place 1 inch apart on prepared baking sheets and bake until golden brown on bottom, about 10 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack. Cool an additional 5 minutes. While cookies are still warm, carefully dip cookies in chai spice blend and transfer to a wire rack over wax paper to cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/chaicrescent2007.jpg"},{"id":44,"name":"Orange-Chocolate Cookies","summary":"2007 winner: Buttery shortbreads with blasts of orange and chocolate. What's not to love?","baker":[{"name":"Ellen Troxel","hometown":"St. Paul"}],"features":["Winner","Chocolate","Fruit"],"cookie_type":"Rolled","year":2007,"recipe_yield":"Makes about 3 dozen.","ingredients_clean":"<ul>\n<li>1 cup (2 sticks) butter, at room temperature, plus extra for chocolate dipping sauce</li>\n<li>1 cup sugar</li>\n<li>1 egg yolk</li>\n<li>2 teaspoons freshly grated orange zest</li>\n<li>2 cups flour, plus extra for rolling dough</li>\n<li>¼ cup orange marmalade, divided</li>\n<li>6 ounces bittersweet chocolate</li>\n</ul>","procedure_clean":"<p>Preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes, scraping sides of bowl occasionally. Add egg yolk and orange zest, and beat until thoroughly combined. Reduce speed to low, add flour and mix until just incorporated.</p>\n<p>On a lightly floured work surface, using a lightly floured rolling pin, roll dough to 1/4-inch thickness. Using a 1 ½ -inch round cookie cutter, cut dough into rounds, and place cookies 1 inch apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used. Using your thumb, make a slight indentation in center of cookie and fill with ¼ teaspoon orange marmalade. Bake until edges are lightly browned, about 12 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p>In a double boiler over gently simmering water, melt chocolate, whisking in enough butter (1 tablespoon at a time, up to about 4 tablespoons) to make a good dipping consistency. Dip half of each cookie in chocolate and place on wax paper until chocolate sets.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/orangechocolate2007.jpg"},{"id":41,"name":"Grandma Eva's Ginger Cream Cookies","summary":"A family favorite boasts a cakey texture and bold molasses bite.","baker":[{"name":"Patricia Bauer","hometown":"Minneapolis"}],"features":["Fun with kids"],"cookie_type":"Rolled","year":2007,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>1 cup (2 sticks) butter, at room temperature</li>\n<li>1 cup granulated sugar</li>\n<li>2 eggs</li>\n<li>1 cup molasses</li>\n<li>2 teaspoons ground cinnamon</li>\n<li>2 teaspoons ground ginger</li>\n<li>1 teaspoon baking soda</li>\n<li>1 teaspoon cream of tartar</li>\n<li>3½ to 4 cups flour, plus extra for rolling dough</li>\n<li>1 cup sour cream</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>4 tablespoons (½ stick) butter, at room temperature</li>\n<li>1 teaspoon vanilla extract</li>\n<li>½ cup milk</li>\n<li>4 cups powdered sugar</li>\n<li>Food coloring and decorative sugars, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition. Add molasses, cinnamon, ginger, baking soda and cream of tartar, and beat until thoroughly combined. Reduce speed to low and add flour and sour cream in three parts, starting with flour and ending with sour cream and mixing until just incorporated. If dough is really sticky, add extra flour, 1 tablespoon at a time. Cover bowl with plastic wrap and refrigerate overnight (or freeze for a few hours) until dough is very stiff.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Lightly flour a work surface and your hands. Take a handful of dough and press it down on work surface, then flip dough and press again, so there is flour on both flat sides of dough. Using a lightly floured rolling pin, roll dough to ¼ -inch thickness.</p>\n<p>Dip cookie cutter in flour and cut out dough, placing cookies 2 inches apart on prepared baking sheets (grouping similar-size cookies on same baking sheet to avoid burning). Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used. Bake until cookies have puffed up a bit and a lightly pressed finger doesn't leave an indentation, about 10 minutes; do not overbake. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium-high speed, beat butter and vanilla extract until fluffy. Add milk and beat until thoroughly combined. Reduce speed to low and add powdered sugar, 1 cup at a time, until icing reaches desired consistency. Add food coloring, if using, 1 drop at a time, and mix until thoroughly combined. Using a knife, spread icing over cookies (recipe makes a generous amount of icing) and sprinkle with decorative sugars, if desired.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/grandmaevaginger.jpg"},{"id":42,"name":"Almond Sandwiches","summary":"Delicate and flaky, these old-fashioned treats melt in your mouth.","baker":[{"name":"Patricia Sanford","hometown":"Edina"}],"features":["Nut"],"cookie_type":"Rolled","year":2007,"recipe_yield":"Makes about 2 dozen sandwich cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>1 cup (2 sticks) butter, at room temperature</li>\n<li>⅓ cup heavy cream</li>\n<li>2 cups flour, plus extra for rolling dough</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>4 tablespoons (½ stick) butter, at room temperature</li>\n<li>¾ cup powdered sugar</li>\n<li>1 pasteurized egg yolk (see Taste Tip)</li>\n<li>½ teaspoon almond extract</li>\n<li>Food coloring, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add cream and beat until thoroughly combined, scraping sides of bowl occasionally. Reduce speed to low, add flour and mix until just incorporated. Form dough into a disk, wrap in plastic wrap and refrigerate at least 30 minutes.</p>\n<p>When ready to bake, preheat oven to 350 degrees. Line baking sheets with parchment paper.</p>\n<p>On a lightly floured work surface, using a lightly floured rolling pin, roll dough to 1/8-inch thickness. Using a 1- to 1½ -inch round cookie cutter, cut dough into rounds and place 1 inch apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used. Bake until edges are lightly browned, 15 to 20 minutes; do not overbake. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium-high speed, beat butter for 30 seconds. Reduce speed to medium-low and add powdered sugar, egg yolk (or milk) and almond extract, and mix until light and fluffy (beat in food coloring, 1 drop at a time, if desired). Spoon 1 teaspoon icing into center of bottom of a cookie. Top with another cookie, bottom side up as if making a sandwich, and gently press cookies together. Repeat until all cookies form sandwiches.</p>","notes":"This dough must be prepared in advance. In the icing recipe, 1 tablespoon milk can be used to substitute for the egg yolk. A pasteurized egg is recommended for food safety reasons.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/almondsandwich2007.jpg"},{"id":39,"name":"Raspberry Truffle Tartlets","summary":"The flavors of chocolate and raspberry stand out on holiday platters.","baker":[{"name":"Tricia Hall","hometown":"Minneapolis"}],"features":["Chocolate","Fruit"],"cookie_type":"Rolled","year":2007,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<ul>\n<li>Nonstick cooking spray</li>\n<li>2½ cups flour</li>\n<li>⅔ cup unsweetened cocoa powder</li>\n<li>1 teaspoon baking soda</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) plus 2 tablespoons unsalted butter, at room temperature</li>\n<li>¾ cup firmly packed brown sugar</li>\n<li>⅔ cup granulated sugar</li>\n<li>2 eggs</li>\n<li>1 teaspoon vanilla extract</li>\n<li>2½ tablespoons raspberry liqueur</li>\n<li>1½ cups semisweet chocolate chips</li>\n<li>8 ounces raspberry preserves</li>\n<li>⅔ cup white chocolate chips</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees. Lightly coat mini-muffin tins with cooking spray.</p>\n<p>In a medium bowl, whisk together flour, cocoa, baking soda and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add brown sugar and granulated sugar and beat until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition. Add vanilla extract and raspberry liqueur and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Stir in semisweet chocolate chips.</p>\n<p>Spoon dough by heaping tablespoonsful and roll into balls. Place balls into prepared mini-muffin tins and bake 7 minutes. Remove from oven and, using back of a spoon, immediately (and gently) flatten tops of tartlets. Transfer tins to a wire rack and cool for about 10 minutes.</p>\n<p>Using a thinly bladed knife, carefully separate tartlets from tin and remove. Transfer tartlets to a wire rack to cool completely.</p>\n<p>In a small bowl, stir preserves. Place ½ teaspoon preserves on top of each tartlet and carefully spread.</p>\n<p>In a double boiler over gently simmering water, melt white chocolate chips, whisking occasionally. Using a spoon, drizzle white chocolate over tartlets.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/raspberrytruffletart2007.jpg"},{"id":45,"name":"Almond Spoons","summary":"Crisp and nutty, this candy-like beauty stands out on a platter.","baker":[{"name":"Sharon Severson","hometown":"North Oaks"}],"features":["Nut"],"cookie_type":"Rolled","year":2008,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<ul>\n<li>7 tablespoons butter</li>\n<li>1 scant cup finely chopped almonds</li>\n<li>1 cup sugar</li>\n<li>1 tablespoon flour</li>\n<li>¼ teaspoon vanilla sugar (see Taste Tip)</li>\n<li>1 tablespoon heavy whipping cream</li>\n<li>1 tablespoon half-and-half</li>\n</ul>","procedure_clean":"<p>Preheat oven to 375 degrees and line baking sheets with parchment paper. Drape plastic wrap over a broomstick-size dowel and place dowel over kitchen sink or raised above countertop.</p>\n<p>In a microwave oven or using a double boiler over gently simmering water, melt butter and then slightly cool.</p>\n<p>In a large bowl, combine melted butter, almonds, sugar, flour, vanilla sugar, cream and half-and-half, and mix thoroughly. Drop teaspoons of dough on prepared baking sheets, spacing cookies 3 inches apart and baking 4 to 6 cookies at a time. Bake until lightly golden brown, about 8 minutes. Remove from oven.</p>\n<p>Carefully slide parchment paper off baking sheet onto a flat work surface. Using a thin metal spatula, lift cookies off parchment paper and drape over prepared dowel to create \"spoon\" shape (it should resemble a crisp taco shell) and cool completely. This is a delicate balance and will take some practice; the cookies need to be cool enough to hold their shape when draped, but not so cool that they have set and hardened. If need be, carefully return parchment paper to hot baking sheet to warm up cookies that have become too cool.</p>","notes":"Vanilla sugar is available in some supermarkets and specialty food stores. It can also be made by splitting 1 vanilla bean, burying it into ½ pound of granulated sugar and storing it in a tightly sealed container for 1 week. Adding 1 tablespoon light corn syrup to the batter can help hold the cookie together.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/almondspoon2008.jpg"},{"id":18,"name":"Kossuth Kifli","summary":"These crescent-shaped, lemon-kissed cookies are a Hungarian favorite.","baker":[{"name":"Linda Paul","hometown":"Minneapolis"}],"features":["Fruit","Nut","International"],"cookie_type":"Bar","year":2003,"recipe_yield":"Makes 2 to 3 dozen cookies","ingredients_clean":"<ul>\n<li>2 teaspoons baking powder</li>\n<li>1⅔ cups flour, plus extra for pan</li>\n<li>1 cup (2 sticks) unsalted butter, plus extra for pan</li>\n<li>1½ cups granulated sugar</li>\n<li>8 eggs, separated</li>\n<li>½ teaspoon vanilla</li>\n<li>Freshly grated peel and juice of 1 lemon</li>\n<li>1½ cups finely chopped walnuts</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees. Butter and flour bottom and sides of a 9- by 13-inch cake pan.</p>\n<p>In a medium bowl, whisk together baking powder and flour, and reserve. In a bowl of an electric mixer on medium-high speed, beat butter and granulated sugar until light and fluffy, about 2 minutes. Add egg yolks, 1 at a time, and beat until creamy. Add vanilla extract, lemon rind and lemon juice, and beat until thoroughly combined. Reduce speed to low, gradually add flour mixture and mix until just incorporated.</p>\n<p>In a bowl of an electric mixer on high speed, beat egg whites until stiff but not dry. Using a spatula, fold egg whites into batter. Gently spread batter into prepared pan. Evenly sprinkle top of batter with walnuts and bake 25 to 30 minutes. Remove from oven and transfer pan to a wire rack.</p>\n<p>Cool until cake shrinks away from sides of pan, about 15 minutes. With a small round biscuit cutter periodically dipped in powdered sugar, cut one circle (don't remove it), then cut another circle halfway down the first one, making two crescents and one oval scrap. Remove from pan and repeat. Cool crescents completely and dust with powdered sugar shaken through a wire-mesh screen. Store in a tightly covered container for up to 2 days.</p>","notes":"Honoring historical figures with a cookie is a time-honored Hungarian tradition, and these honor General Louis Kossuth, a 19th-century Hungarian revolutionary hero (pronounced coo-SOOTH KEY-flee). Kifli is Hungarian for crescent.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377197.jpg"},{"id":35,"name":"Nutmeg Sticks","summary":"A spritz-inspired treat.","baker":[{"name":"Kathie Nelson","hometown":"Richfield"}],"features":["Easy","Fun with kids"],"cookie_type":"","year":2004,"recipe_yield":"Makes about 8 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>3 cups flour</li>\n<li>1 teaspoon freshly grated nutmeg</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) butter, at room temperature</li>\n<li>¾ cup granulated sugar</li>\n<li>1 egg</li>\n<li>2 teaspoons vanilla extract</li>\n<li>2 teaspoons rum flavoring (or 1 to 2 tablespoons rum, to taste)</li>\n</ul>\n<div><strong>For frosting</strong></div>\n<ul>2 cups powdered sugar</li>\n<li>⅓ cup (5⅓ tablespoons) unsalted butter, at room temperature</li>\n<li>2 teaspoons vanilla extract</li>\n<li>2 teaspoons rum flavoring (or 1 to 2 tablespoons rum, to taste)</li>\n<li>2 tablespoons heavy cream</li>\n<li>Freshly grated nutmeg for garnish</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together flour, nutmeg and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Gradually add granulated sugar and beat until light and fluffy, about 2 minutes. Add egg and beat until thoroughly combined. Add vanilla extract and rum flavoring and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated.</p>\n<p>Spoon dough into a cookie press fitted with a small (5/8-inch) star plate. Holding press in an almost horizontal position, form long rolls on prepared baking sheets (rolls can be placed close together, as cookies do not spread when baked). Cut rolls into 3-inch sticks. Bake 10 minutes. Remove from oven and allow cookies to cool completely before transferring to a wire rack.</p>\n<p><strong>To prepare frosting:</strong> In a bowl of an electric mixer on medium speed, beat butter until creamy, about 1 minute. Gradually add powdered sugar and beat until light and fluffy, about 2 minutes. Add vanilla extract and rum flavoring and beat until well combined. Add cream and beat until frosting is light and creamy. Frost each cookie and sprinkle with nutmeg.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377602.jpg"},{"id":32,"name":"Cranberry-filled Cookies","summary":"A Wisconsin cranberry festival inspired a home economics teacher.","baker":[{"name":"Wendy Nickel","hometown":"Kiester"}],"features":["Fruit"],"cookie_type":"","year":2004,"recipe_yield":"Makes 4 dozen cookies.","ingredients_clean":"<ul>\n<li>2½ cups flour, plus extra for rolling dough</li>\n<li>1 teaspoon baking powder</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>1½ cups sugar, divided</li>\n<li>2 teaspoons vanilla extract</li>\n<li>1 egg</li>\n<li>1½ cups dried cranberries</li>\n<li>1 tablespoon freshly grated orange zest</li>\n<li>1½ cups water</li>\n<li>2 tablespoons cornstarch</li>\n</ul>","procedure_clean":"<p>In a medium bowl, sift together flour, baking powder and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add 1 cup sugar and beat until light and fluffy, about 2 minutes. Add vanilla extract and beat until thoroughly combined. Add egg and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Cover with plastic wrap and refrigerate at least 2 hours.</p>\n<p>In a small saucepan over medium-high heat, combine remaining ½ cup sugar, cranberries, orange zest, water and cornstarch, and cook, stirring occasionally, until thickened, about 5 minutes. Remove from heat and cool.</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>On a lightly floured work surface, using a lightly floured rolling pin, roll out dough to 1/8-inch thickness. Cut dough into 3-inch circles, placing cookies 2 inches apart on prepared baking sheets. Repeat with remaing dough, gathering up scraps, re-rolling and cutting until all dough is used. Place 1 heaping teaspoon of cranberry mixture into center of each cookie. Fold edges of dough towards center, leaving most of cranberry mixture uncovered. Bake until lightly browned, 12 to 15 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377497.jpg"},{"id":47,"name":"Zazvorniky","summary":"Add this Slovakian tradition to your holiday cookie tray.","baker":[{"name":"Kevin Hurbanis","hometown":"Minneapolis"}],"features":["International"],"cookie_type":"Rolled","year":2005,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>2½ cups flour, plus extra for rolling dough</li>\n<li>2 teaspoons ground ginger</li>\n<li>1 tablespoon baking powder</li>\n<li>2 eggs</li>\n<li>2 egg yolks</li>\n<li>4 tablespoons (½ stick) butter, at room temperature</li>\n<li>2 cups powdered sugar</li>\n</ul>","procedure_clean":"<p>In a large bowl, whisk together flour, ginger and baking powder, and reserve. In a bowl of an electric mixer on medium-high speed, beat eggs, egg yolks and butter until creamy, about 2 minutes. Add powdered sugar and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated.</p>\n<p>On a lightly floured pastry board, with lightly floured hands, knead dough well, adding flour if dough is sticky. Place dough in a large bowl, cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>On a lightly floured pastry board, using a lightly floured rolling pin, roll dough to a ½-inch thickness. Cut dough with cookie cutters and place cookies 1 inch apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used. Cover baking sheets with plastic wrap and refrigerate overnight.</p>\n<p>When ready to bake, preheat oven to 350 degrees. Bake 10 to 12 minutes; cookies should double in height while baking, with the top half spongier than the bottom. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"Line baking sheets with parchment paper.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377712.jpg"},{"id":38,"name":"Acorn Cookies","summary":"A simple drop cookie that looks far fancier.","baker":[{"name":"Barbara Melom","hometown":"Minneapolis"}],"features":["Nut"],"cookie_type":"Drop","year":2005,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<div><strong>For dough</strong></div>\n<ul>1 cup (2 sticks) butter, at room temperature</li>\n<li>¾ cup firmly packed dark brown sugar</li>\n<li>1 teaspoon vanilla extract</li>\n<li>⅓ cup finely chopped pecans</li>\n<li>2½ cups flour</li>\n<li>½ teaspoon baking powder</li>\n</ul>\n<div><strong>For topping</strong></div>\n<ul>24 caramels, unwrapped</li>\n<li>⅛ to ¼ cup water</li>\n<li>¾ cup chopped pecans</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium saucepan over low heat, melt butter. Remove from heat, transfer butter to a large bowl and stir in brown sugar, vanilla extract and pecans.</p>\n<p>In a medium bowl, whisk together flour and baking powder. Add flour mixture to butter mixture and mix until thoroughly combined. Shape dough into 1-inch balls and place cookies 2 inches apart on prepared baking sheets. Flatten balls on bottoms and pinch tops to form a point so dough resembles an acorn. Bake until golden brown, 15 to 18 minutes. Remove from oven and cool for 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare topping:</strong> In a double boiler over gently simmering water, melt caramels. Add 1/8 cup water to thin melted caramel, adding more water, 1 teaspoon at a time, until caramel sauce reaches spreading consistency. Dip flat side of cookie into caramel sauce and then into chopped pecans. Transfer cookies to wax paper until caramel sets.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377772_NBGacyL.jpg"},{"id":46,"name":"Frosted Cashew Cookies","summary":"Pecans, almonds and walnuts are cookie standards. So try cashews instead.","baker":[{"name":"Anne Marie Draganowski","hometown":"West St. Paul"},{"name":"DeNae Shewmake","hometown":"Burnsville"}],"features":["Nut"],"cookie_type":"Drop","year":2005,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<div><strong>For dough</strong></div>\n<ul>2 cups flour</li>\n<li>¾ teaspoon baking soda</li>\n<li>¾ teaspoon baking powder</li>\n<li>¼ teaspoon salt</li>\n<li>½ cup (1 stick) unsalted butter, at room temperature</li>\n<li>1 cup firmly packed brown sugar</li>\n<li>1 egg</li>\n<li>½ teaspoon vanilla extract</li>\n<li>⅓ cup sour cream</li>\n<li>1 cup chopped salted cashews</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>½ cup (1 stick) unsalted butter, at room temperature</li>\n<li>3 tablespoons heavy cream</li>\n<li>¼ teaspoon vanilla extract</li>\n<li>2 to 2½ cups powdered sugar</li>\n<li>Whole salted cashews</li>\n</ul>","procedure_clean":"<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add brown sugar and beat until light and fluffy, about 2 minutes. Add egg and vanilla extract and beat until thoroughly combined. Reduce speed to low and add flour mixture in three batches, alternating with sour cream in two batches and mixing until just incorporated. Fold in chopped cashews.</p>\n<p>Drop by rounded teaspoons 2 inches apart onto prepared cookie sheets and bake until cookies are just set and turning golden around edges, about 10 to 12 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> Melt butter in a small saucepan over medium-high heat, then cook another 3 to 5 minutes after butter has melted, watching carefully and swirling pan to make sure butter doesn't burn. When butter is dark brown and smells nutty, remove from heat. Stir in cream and vanilla extract. Add 1½ cups powdered sugar, whisking until smooth, gradually adding more powdered sugar, 1 tablespoon at a time, until icing is thick enough to spread. Immediately ice cooled cookies and top each iced cookie with a whole cashew.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377767.jpg"},{"id":22,"name":"Taffy Treats","summary":"2003 winner: The look of candied apples inspires this great-looking caramel and walnut cookie.","baker":[{"name":"Sherryl Joos","hometown":"Plymouth"}],"features":["Winner","Nut"],"cookie_type":"","year":2003,"recipe_yield":"3 dozen cookies","ingredients_clean":"<ul>\n<li>1⅓ cups walnuts, divided</li>\n<li>⅓ cup granulated sugar</li>\n<li>1 cup evaporated milk, divided</li>\n<li>½ cup (1 stick) butter</li>\n<li>¼ cup firmly packed brown sugar</li>\n<li>¼ cup sifted powdered sugar</li>\n<li>¼ teaspoon salt</li>\n<li>1 egg</li>\n<li>1 teaspoon vanilla extract</li>\n<li>2 cups flour</li>\n<li>Round, colored toothpicks</li>\n<li>1 (14-ounce) package caramels, unwrapped</li>\n<li>1 to 2 tablespoons water, if necessary</li>\n</ul>","procedure_clean":"<p><strong>To prepare filling:</strong> In a food processor fitted with a metal blade, pulse walnuts until finely chopped. In a small saucepan over medium heat, combine 1/3 cup of ground walnuts (reserve remaining walnuts), granulated sugar and 1/3 cup evaporated milk, and cook, stirring constantly, until very thick, about 5 minutes. Cool and reserve.</p>\n<p><strong>To prepare dough:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, brown sugar, powdered sugar and salt until light and fluffy, about 2 minutes. Add egg and vanilla extract and beat until thoroughly combined. Reduce speed to low, add flour and mix until just incorporated.</p>\n<p>Shape dough into 1-inch balls. Make a depression in ball with your thumb and drop ¼ teaspoon filling into depression. Reshape cookie into a ball, enclosing the filling. Place cookies 2 inches apart on prepared baking sheets and bake 15 to 18 minutes, or until lightly browned. Remove from oven and cool 2 minutes before transferring cookies to a wire rack. Insert a rounded colored wooden toothpick into top of each cookie and cool completely.</p>\n<p><strong>To prepare caramel coating:</strong> In a double boiler over gently simmering water, combine caramels and remaining 2/3 cup evaporated milk and heat until caramels melt, stirring occasionally (if too thick, thin with water, 1 tablespoon at a time). Remove from heat but keep mixture warm over hot water (If using a microwave oven, melt caramels in 1-minute intervals, stirring and repeating until caramel is melted).</p>\n<p>Dip cookies into caramel coating, allowing excess caramel to drop off (cookies can be double-dipped). Dip bottom of cookie in remaining ground walnuts and place on wax or parchment paper to set.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70003122.jpg"},{"id":34,"name":"Swiss Chocolate Buttersweets","summary":"A cheesecake-style cookie exemplifies holiday decadence.","baker":[{"name":"Dianne Kemp","hometown":"Chanhassen"}],"features":["Chocolate","Nut"],"cookie_type":"Drop","year":2004,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For filling</strong></div>\n<ul>8 ounces cream cheese, at room temperature</li>\n<li>1 cup powdered sugar</li>\n<li>¼ cup flour</li>\n<li>1½ teaspoons vanilla extract</li>\n<li>1 cup chopped walnuts, optional</li>\n<li>½ cup coconut</li>\n</ul>\n<div><strong>For cookies</strong></div>\n<ul>2 ¼ cups flour</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>1 cup powdered sugar</li>\n<li>2 teaspoons vanilla extract</li>\n</ul>\n<div><strong>For frosting</strong></div>\n<ul>1 cup milk chocolate or semisweet chocolate chips</li>\n<li>4 tablespoons (½ stick) unsalted butter</li>\n<li>2 tablespoons water</li>\n<li>1 tablespoon white corn syrup</li>\n<li>1½ cups powdered sugar</li>\n</ul>","procedure_clean":"<p><strong>To prepare filling:</strong> In a bowl of an electric mixer on medium-high speed, beat cream cheese until creamy, about 1 minute. Gradually add powdered sugar and beat until light and fluffy, about 2 minutes. Add vanilla extract and beat until well-combined. Reduce speed to low, add flour and mix until just incorporated. Stir in nuts, if using, and coconut, and reserve.</p>\n<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together flour and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Gradually add powdered sugar and beat until light and fluffy, about 2 minutes. Add vanilla extract and beat until well-combined. Reduce speed to low, add flour mixture and mix until just incorporated.</p>\n<p>Shape teaspoonfuls of dough into balls, place 2 inches apart on prepared baking sheets and make an indentation in center of each cookie with your thumb. Bake until very lightly browned, 12 to 15 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack.</p>\n<p>While cookies are still warm, fill indentations with cream cheese mixture. Cool cookies completely.</p>\n<p><strong>To prepare frosting:</strong> In a double boiler over gently simmering water (or in a microwave oven), melt chocolate chips and butter. Stir in water and corn syrup. Add powdered sugar and whisk until smooth. Frost each cookie.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377492.jpg"},{"id":48,"name":"Cardamom Shortbread Cookies","summary":"Shortbread -- and cardamom -- flavor without all the fuss.","baker":[{"name":"Alecia Enger","hometown":"Hudson, Wisconsin"}],"features":["Fruit","Nut","International"],"cookie_type":"Bar","year":2005,"recipe_yield":"Makes about 3 dozen bar cookies.","ingredients_clean":"<div><strong>For dough</strong></div>\n<ul>2 cups flour</li>\n<li>2 teaspoons ground cardamom</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>½ cup granulated sugar</li>\n<li>½ cup light brown sugar</li>\n<li>1 egg, separated</li>\n<li>1 teaspoon vanilla extract</li>\n<li>1/3 cup chopped nuts</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>1½ tablespoons butter, melted</li>\n<li>½ teaspoon vanilla extract</li>\n<li>1 cup powdered sugar</li>\n<li>Milk as needed</li>\n<li>Candied fruit, if desired, for garnish</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 275 degrees.</p>\n<p>In a medium bowl, whisk together flour, cardamom and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add granulated sugar and brown sugar and beat until light and fluffy, about 2 minutes. Add egg yolk and vanilla extract and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Spread dough into an ungreased 9- by 13-inch baking pan. Brush egg white over dough, sprinkle evenly with chopped nuts and bake for 1 hour. Remove from oven and transfer pan to a wire rack to cool.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium speed, beat melted butter, vanilla extract and powdered sugar until creamy. Add milk, 1 teaspoon at a time, until icing reaches drizzling consistency. Spread icing over slightly warm bars and garnish with candied fruit (optional). Allow icing to set and cut bars into cookies while bars are still slightly warm.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377722_bLVuE6q.jpg"},{"id":49,"name":"Korova Cookies","summary":"2006 winner: Chocolate, more chocolate, and sea salt, a winning combination.","baker":[{"name":"Mary Eckmeier","hometown":"St. Paul"}],"features":["Winner","Easy","Chocolate"],"cookie_type":"Refrigerator","year":2006,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>1¼ cups flour</li>\n<li>⅓ cup unsweetened cocoa powder</li>\n<li>½ teaspoon sel de guerande or other coarse sea salt (see Taste Tip)</li>\n<li>½ teaspoon baking soda</li>\n<li>½ cup plus 3 tablespoons (1 stick plus 3 tablespoons) unsalted butter, at room temperature</li>\n<li>⅔ cup firmly packed brown sugar</li>\n<li>¼ cup granulated sugar</li>\n<li>1 teaspoon vanilla extract</li>\n<li>5 ounces (about ¾ cup) semisweet chocolate chips</li>\n</ul>","procedure_clean":"<p>In a medium bowl, whisk together flour, cocoa powder, sea salt and baking soda, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add brown sugar, granulated sugar and vanilla extract, and beat until light and fluffy, about 2 minutes.</p>\n<p>Reduce speed to low, add flour mixture and mix until crumbly, just enough so flour is not blowing all over bowl. Using a spatula, fold in chocolate chips.</p>\n<p>Dump mixture onto a clean work surface and knead a few times to finish mixing (the warmth of your hands will help the mixture come together). Divide dough in half and shape into logs about 18 inches in length and about 1 inch in diameter. Wrap in plastic wrap and refrigerate at least 1 hour or for up to 3 days.</p>\n<p>When ready to bake, preheat oven to 325 degrees and line baking sheets with parchment paper.</p>\n<p>Unwrap dough logs and, using a sharp knife, trim off uneven ends. Cut dough into ½-inch slices (if cookies come apart after slicing, just push dough back together using your fingers) and place cookies (flat side down) 1 inch apart on prepared baking sheets. Bake 12 minutes; do not overbake. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance. Sel de guerande is a sea salt that is harvested from the salt marshes of Brittany and is available at many specialty cooking stores. This recipe was adapted from “Paris Sweets,” by Dorie Greenspan.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377982.jpg"},{"id":50,"name":"Pumpkin Cookies","summary":"The flavors of Thanksgiving also work beautifully during the holiday season.","baker":[{"name":"Amy Karlen","hometown":"Minnetonka"}],"features":["Easy"],"cookie_type":"Drop","year":2006,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>3½ cups sifted flour</li>\n<li>2 teaspoons baking soda</li>\n<li>1 teaspoon salt</li>\n<li>2 teaspoons ground cinnamon</li>\n<li>1½ teaspoons freshly grated nutmeg</li>\n<li>1 teaspoon ground ginger</li>\n<li>½ teaspoon ground cloves</li>\n<li>1 cup shortening</li>\n<li>2 cups granulated sugar</li>\n<li>2 eggs, beaten</li>\n<li>1 cup pumpkin puree</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>5 tablespoons brown sugar</li>\n<li>3 tablespoons butter</li>\n<li>5 tablespoons milk</li>\n<li>1 cup powdered sugar, plus extra if needed</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together flour, baking soda, salt, cinnamon, nutmeg, ginger and cloves, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat shortening and granulated sugar until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition. Add pumpkin puree and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Drop rounded teaspoons of dough 2 inches apart onto prepared cookie sheets and bake for 10 minutes; do not overbake. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a small saucepan over medium heat, combine brown sugar, butter and milk, and bring mixture to a boil. Remove from heat, set aside and cool completely, about an hour. Whisk in powdered sugar until icing is desired consistency, adding more if necessary. Ice cookies to taste.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377877.jpg"},{"id":51,"name":"Orange Kisses","summary":"Tender, dainty, frosted, lovely.","baker":[{"name":"Bette Revoir","hometown":"St. Paul"}],"features":["Fruit"],"cookie_type":"Drop","year":2006,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>2 cups flour</li>\n<li>½ teaspoon baking soda</li>\n<li>½ teaspoon salt</li>\n<li>½ teaspoon baking powder</li>\n<li>⅔ cup (1 stick plus 2 2/3 tablespoons) unsalted butter, at room temperature</li>\n<li>¾ cup granulated sugar</li>\n<li>1 egg</li>\n<li>2 tablespoons freshly grated orange zest</li>\n<li>½ cup freshly squeezed orange juice</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>2 cups powdered sugar</li>\n<li>2 tablespoons butter, at room temperature</li>\n<li>2 tablespoons freshly squeezed orange juice, plus extra if needed</li>\n<li>1 tablespoon freshly grated orange zest</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a medium bowl, whisk together flour, baking soda, salt and baking powder, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add granulated sugar and beat until light and fluffy, about 2 minutes. Add egg and beat until thoroughly combined. Add orange zest and beat until thoroughly combined. Add orange juice and beat for 30 seconds. Reduce speed to low, slowly add flour mixture and mix until just incorporated. Cover with plastic wrap and refrigerate at least 30 minutes.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Drop dough by rounded teaspoons 2 inches apart onto prepared baking sheets and bake until edges of cookies are lightly browned, about 8 to 10 minutes. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on low speed, mix powdered sugar, butter, orange juice and orange zest until combined, adding more orange juice if necessary to make right consistency. Ice cookies to taste.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377872.jpg"},{"id":53,"name":"Ricotta Cheese Cookies","summary":"Ricotta cheese is the secret ingredient in these oh-so tender sugar cookies.","baker":[{"name":"Mary Beth Conzett","hometown":"Plymouth"}],"features":["Easy"],"cookie_type":"Drop","year":2008,"recipe_yield":"Makes about 6 dozen cookies.","ingredients_clean":"<div><strong>For cookie</strong></div>\n<ul>4 cups flour</li>\n<li>2 tablespoons baking powder</li>\n<li>1 teaspoon salt</li>\n<li>1 cup (2 sticks) unsalted butter, at room temperature</li>\n<li>2 cups sugar</li>\n<li>15 ounces ricotta cheese</li>\n<li>2 teaspoons vanilla extract</li>\n<li>2 eggs</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>1½ cups powdered sugar</li>\n<li>3 tablespoons milk</li>\n<li>Red and green decorative sugars, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together flour, baking powder and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes. Reduce speed to medium, add ricotta cheese, vanilla extract and eggs, and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix just until dough forms.</p>\n<p>Drop dough by level tablespoons, about 2 inches apart, on prepared baking sheets. Bake until cookies are lightly golden, about 15 minutes (cookies will be soft). Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a medium bowl, whisk together powdered sugar and milk until smooth, adding more milk or powdered sugar as necessary for desired consistency. Using a small spatula or knife, spread icing on cookies (and top with decorative sugar, if desired). Allow icing to set for 1 hour before serving.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/ricottacheese2008.jpg"},{"id":54,"name":"Viennese Wafers with Lemon","summary":"Thyme adds an unexpected touch to this buttery, lemony favorite.","baker":[{"name":"Margaret DeHarpporte","hometown":"Eden Prairie"}],"features":["Easy","Fruit","Nut"],"cookie_type":"Rolled","year":2008,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<ul>\n<li>½ cup (1 stick) butter, at room temperature</li>\n<li>⅓ cup sugar</li>\n<li>¼ teaspoon vanilla extract</li>\n<li>Freshly grated zest from 1 lemon</li>\n<li>2 teaspoons freshly chopped thyme, or 1 teaspoon dried thyme</li>\n<li>¾ cup plus 1 tablespoon flour, plus extra for rolling dough</li>\n<li>1 egg white, slightly beaten</li>\n<li>¾ cup sliced almonds, roughly chopped</li>\n</ul>","procedure_clean":"<p>In bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes. Add vanilla extract, lemon zest and thyme, and beat until thoroughly combined. Reduce speed to low, add flour and mix until just incorporated. Shape dough into a disc, wrap in plastic wrap and refrigerate at least 1 hour or overnight.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>On a lightly floured work surface, using a lightly floured rolling pin, roll dough into a rectangular shape no less than ¼ -inch thick. Trim edges with knife or pizza cutter and cut dough into 1½- to 2-inch squares.</p>\n<p>Using a pastry brush, brush top of bars lightly with egg white and sprinkle with chopped almonds. Gently press almonds into dough. Using a thin-bladed spatula, carefully transfer cookies to prepared baking sheets, spacing cookies 1 inch apart, and bake until lightly browned, about 20 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/viennesewafer2008.jpg"},{"id":55,"name":"Cranberry Cat Kisses","summary":"A mother-daughter team used Russian Tea Cakes as a starting point.","baker":[{"name":"Hannah Park","hometown":"St. Paul"},{"name":"Anne Park","hometown":"St. Paul"}],"features":["Chocolate","Nut"],"cookie_type":"Drop","year":2006,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>1 cup (2 sticks) butter, at room temperature</li>\n<li>½ cup powdered sugar</li>\n<li>½ teaspoon almond extract</li>\n<li>2¼ cups flour</li>\n<li>¾ cup finely chopped almonds</li>\n<li>½ cup dried cranberries, finely chopped</li>\n</ul>\n<div><strong>For chocolate coating</strong></div>\n<ul>1 cup semisweet chocolate chips</li>\n<li>2 tablespoons shortening</li>\n<li>Sliced almonds for decoration</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 400 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl using an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add powdered sugar and beat until light and fluffy, about 2 minutes. Add almond extract and beat until thoroughly combined. Reduce speed to low, add flour and mix until just incorporated. Stir in almonds and dried cranberries. Roll dough into 1-inch balls, place 2 inches apart on prepared baking sheets and bake until cookies are set but not browned, 7 to 8 minutes. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare chocolate coating:</strong> In a double boiler over gently simmering water (or in a microwave oven), melt chocolate chips and shortening, and whisk until combined. Dip cookies in chocolate, decorate with an almond slice and transfer to wax paper until chocolate sets.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-70377867.jpg"},{"id":56,"name":"Cranberry-Pumpkin Seed Biscotti","summary":"Say \"Happy holidays\" with a festive cranberry-accented biscotti.","baker":[{"name":"Phyllis Kahn","hometown":"Minneapolis"}],"features":["Fruit","Nut"],"cookie_type":"Refrigerator","year":2008,"recipe_yield":"Makes about 2 dozen biscotti.","ingredients_clean":"<ul>\n<li>4½ cups flour</li>\n<li>1 teaspoon baking soda</li>\n<li>1 teaspoon baking powder</li>\n<li>½ teaspoon salt</li>\n<li>2 teaspoons slightly mashed fennel seeds</li>\n<li>2 cups sugar</li>\n<li>4 tablespoons (½ stick) butter, melted and cooled</li>\n<li>5 eggs, beaten</li>\n<li>2 teaspoons vanilla extract</li>\n<li>Freshly grated zest of 2 oranges</li>\n<li>2 cups dried cranberries</li>\n<li>2 cups raw pumpkin seeds (pepitas)</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a large bowl, whisk together flour, baking soda, baking powder, salt and fennel seeds, and reserve. In a bowl of an electric mixer on medium-high speed, beat together sugar, butter, eggs, vanilla extract and orange rind until thoroughly combined, about 2 minutes. Reduce speed to low, add flour mixture and mix until just incorporated. Stir in cranberries and pumpkin seeds.</p>\n<p>Divide dough into 4 equal parts and form each part into logs that are approximately 10 inches long and 2 inches wide. Transfer logs to prepared baking sheets and bake until golden brown and an inserted skewer comes out clean, about 25 to 30 minutes. Remove from oven and cool for 5 minutes. Transfer baked logs to a cutting board and cut logs diagonally into ½-inch thick slices.</p>\n<p>Reduce oven to 325 degrees. Return slices, cut-side up, on prepared baking sheets and bake for about 5 minutes. Remove from oven, turn biscotti over and bake an additional 5 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cranberrypumpseedbiscotti2008.jpg"},{"id":52,"name":"Double Chocolate-Cherry Espresso Drops","summary":"2008 winner: A simple drop cookie boasts a complex flavor profile.","baker":[{"name":"Faith Ford","hometown":"Big Lake"}],"features":["Winner","Easy","Chocolate","Fruit"],"cookie_type":"Drop","year":2008,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<ul>\n<li>1 tablespoon instant espresso powder</li>\n<li>1 tablespoon boiling water</li>\n<li>1 cup flour</li>\n<li>¾ cup unsweetened cocoa powder</li>\n<li>1 teaspoon baking soda</li>\n<li>¼ teaspoon salt</li>\n<li>½ cup (1 stick) butter, at room temperature</li>\n<li>⅔ cup granulated sugar</li>\n<li>¼ cup packed dark brown sugar</li>\n<li>1 egg</li>\n<li>¼ teaspoon vanilla extract</li>\n<li>½ cup chopped dried cherries</li>\n<li>¾ cup semisweet chocolate chips</li>\n<li>White chocolate for decoration, optional</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, mix instant espresso powder and water, and reserve. In a small bowl, whisk together flour, cocoa powder, baking soda and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add granulated sugar and beat until light and fluffy, about 2 minutes. Add dark brown sugar and beat until thoroughly combined. Add egg and beat until thoroughly combined. Add vanilla extract and reserved espresso mixture and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Stir in cherries and chocolate chips.</p>\n<p>Using a 1-inch scoop, drop cookie dough 2 inches apart on prepared baking sheets. Bake for 8 to 10 minutes; because cookie is very dark, it's difficult to tell if they are overbaked. Watch center of cookies; when they lose their gooey quality, they are done. Remove from oven and cool 10 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p>If desired, melt white chocolate in a microwave oven or using a double boiler over gently simmering water, and lightly drizzle over cookies.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/doublechoccherryespresso2008.jpg"},{"id":57,"name":"Cardamom Cookies","summary":"These crisp treats will fill your kitchen with the intoxicating scent of cardamom.","baker":[{"name":"Matt Boisen","hometown":"Owatonna"}],"features":["International"],"cookie_type":"Drop","year":2008,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>½ teaspoon baking soda</li>\n<li>1 teaspoon ground cardamom</li>\n<li>1 teaspoon ground cinnamon</li>\n<li>1½ cups flour</li>\n<li>½ cup (1 stick) butter, at room temperature</li>\n<li>1 cup sugar</li>\n<li>1 egg</li>\n</ul>\n<div><strong>For icing</strong></div>\n<ul>4 tbsp. butter, at room temperature</li>\n<li>1 teaspoon vanilla extract</li>\n<li>½ cup milk</li>\n<li>¼ teaspoon ground cardamom</li>\n<li>¼ teaspoon ground cinnamon</li>\n<li>4 cups powdered sugar</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, whisk together baking soda, cardamom, cinnamon and flour, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes. Add egg and beat until thoroughly combined.</p>\n<p>Reduce speed to low, add flour mixture and mix until just incorporated. Roll dough into balls and place 2 inches apart on prepared baking sheets. Carefully press dough with flat bottom of a drinking glass and bake until lightly browned, 14 to 16 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium-high speed, beat butter and vanilla extract until light and fluffy. Add milk, cardamom and cinnamon, and beat well. Reduce speed to low and add powdered sugar to reach desired consistency. Spread icing on cooled cookies.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cardamomcookies2008.jpg"},{"id":59,"name":"Almond Triangles","summary":"2009 winner: Shortbread plus almonds equals delicious","baker":[{"name":"Charlotte Midthun","hometown":"Granite Falls"}],"features":["Winner","Nut"],"cookie_type":"Bar","year":2009,"recipe_yield":"Makes about 6 dozen cookies.","ingredients_clean":"<ul>\n<li>2 cups (4 sticks) butter, at room temperature, divided</li>\n<li>¾ cup granulated sugar, divided</li>\n<li>1 egg</li>\n<li>¾ teaspoon almond extract</li>\n<li>½ teaspoon salt</li>\n<li>2¾ cups flour</li>\n<li>1 cup packed brown sugar</li>\n<li>1/3 cup honey</li>\n<li>¼ cup heavy cream</li>\n<li>1 pound (about 5¼ cups) sliced almonds</li>\n</ul>","procedure_clean":"<p>Carefully line a 10- by 15-inch jelly roll pan with aluminum foil, shiny side up.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat 1 cup (2 sticks) butter until creamy, about 1 minute. Gradually add ½ cup granulated sugar and beat until light and fluffy, about 2 minutes. Add egg, almond extract and salt, and beat until thoroughly combined. Reduce speed to low, add flour and mix until just incorporated. Press dough evenly into pan and push dough up sides. Cover with plastic wrap and refrigerate 30 minutes.</p>\n<p>When ready to bake, preheat oven to 375 degrees.</p>\n<p>Using a fork, prick dough in 20 to 24 places all across dough and bake 10 minutes. Remove from oven and transfer pan to a wire rack to cool.</p>\n<p>In a large saucepan over medium heat, combine brown sugar, honey, remaining 1 cup (2 sticks) butter and remaining ¼ cup granulated sugar, and cook, stirring occasionally, until sugar dissolves. Increase heat to medium-high, bring mixture to a boil and cook for 3 minutes without stirring.</p>\n<p>Remove from heat and stir in cream. Stir in almonds. Spread almond mixture evenly over crust. Return pan to oven and bake until bubbling, about 15 minutes. Remove from oven and transfer pan to a wire rack to cool. While bars are still slightly warm, cut into triangles.</p>","notes":"This recipe must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/almondtriangles_1.jpg"},{"id":60,"name":"Persian Molasses Crinkles","summary":"Pomegranate adds zip to these soft, chewy cookies.","baker":[{"name":"Lance Swanson","hometown":"North Branch"}],"features":["Fruit","Nut","International"],"cookie_type":"Drop","year":2009,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>2½ cups flour</li>\n<li>2 teaspoons baking soda</li>\n<li>¼ teaspoon salt</li>\n<li>¾ cup shortening</li>\n<li>1 cup sugar</li>\n<li>6 tablespoons pomegranate molasses (see Taste Tip)</li>\n<li>2 teaspoons freshly grated lemon zest</li>\n<li>1 egg</li>\n<li>¾ cup slivered almonds, toasted and very finely chopped</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together flour, baking soda and salt, and reserve. In a bowl of an electric mixer on medium-high speed, beat shortening and sugar until light and fluffy, about 2 minutes. Add pomegranate molasses and lemon zest, and beat until thoroughly combined. Add egg and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated (dough will be soft).</p>\n<p>Form dough into 1-inch balls, dip dough into chopped almonds, place cookies 2 inches apart on prepared baking sheets, almonds-side up, and bake until cookies are puffed and deeply cracked, 10 to 12 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"Pomegranate molasses is available in Middle Eastern food shops or in the imported foods sections of most supermarkets. To prepare pomegranate molasses, combine 4 cups pomegranate juice, ½ cup sugar and 1 tablespoon freshly squeezed lemon juice in a medium saucepan over medium heat and cook, stirring, until sugar dissolves. Reduce heat to medium-low and cook until syrup reduces to 1 cup and is the consistency of thick syrup, about 75 minutes. Remove from heat, cool for 30 minutes and transfer to an uncovered glass jar to cool completely. To toast slivered almonds, preheat oven to 325 degrees. Spread nuts on an ungreased baking sheet and bake for 5 to 7 minutes, stirring often. Remove from oven and cool.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/persianmolasses2009.jpg"},{"id":61,"name":"French-Swiss Butter Cookies","summary":"Cinnamon puts a tasty twist to these nut-topped sugar cookies.","baker":[{"name":"Ramona Doebler","hometown":"Elk River"}],"features":["Easy","Nut"],"cookie_type":"Drop","year":2009,"recipe_yield":"Makes about 5 dozen cookies.","ingredients_clean":"<ul>\n<li>1 cup (2 sticks) butter</li>\n<li>1 cup sugar</li>\n<li>1 egg, divided</li>\n<li>2½ teaspoons ground cinnamon</li>\n<li>2 cups flour, plus extra for pressing dough</li>\n<li>Finely chopped walnuts (or pecans or decorative sugar)</li>\n</ul>","procedure_clean":"<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Gradually add sugar and beat until light and fluffy, about 2 minutes. Add egg yolk and beat until thoroughly combined. Reduce speed to low, add cinnamon and flour and mix until just incorporated. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper. In a small bowl, slightly beat reserved egg white with a fork. Roll dough into small balls and place 2 inches apart on prepared baking sheets. Dip a flat-bottomed glass in flour and press dough to 1/16- to 1/8-inch thickness, re-flouring glass with each cookie.</p>\n<p>Brush a little egg white in center of each cookie and sprinkle chopped walnuts (or pecans or decorative sugar) in center of cookie. Bake 10 to 12 minutes; do not overbake. Remove from oven, cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/frenchswissbutter2009.jpg"},{"id":62,"name":"Clare-oes","summary":"Like Oreos? You'll love this softer, richer, coffee-flavored version.","baker":[{"name":"Jane Stern","hometown":"Minneapolis"}],"features":["Chocolate"],"cookie_type":"Rolled","year":2009,"recipe_yield":"Makes about 15 sandwich cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>1¼ cups flour, plus extra for rolling dough</li>\n<li>2 teaspoons instant espresso powder</li>\n<li>¼ teaspoon salt</li>\n<li>¾ cup (1½ sticks) unsalted butter, at room temperature</li>\n<li>¾ cup granulated sugar</li>\n<li>1 egg</li>\n<li>1 teaspoon vanilla extract</li>\n<li>¾ cup Dutch process cocoa powder, sifted</li>\n</ul>\n<div><strong>For buttercream filling</strong></div>\n<ul>3 tablespoons unsalted butter, at room temperature</li>\n<li>1 cup plus 2 tablespoons powdered sugar</li>\n<li>1 tablespoon strongly brewed coffee, plus extra if filling is too thick</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a medium bowl, whisk together flour, espresso powder and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Gradually add granulated sugar and beat until light and fluffy, about 2 minutes. Add egg and beat until thoroughly combined, scraping down sides of bowl as necessary. Add vanilla extract and beat until thoroughly combined. Reduce speed to low and gradually add cocoa powder, scraping down sides of bowl as necessary and mixing until just incorporated. Add flour mixture in 3 additions, mixing until just incorporated. Divide dough into two equal pieces, shape into disks, wrap in plastic wrap and refrigerate at least 2 hours or overnight.</p>\n<p>When ready to bake, preheat oven to 325 degrees and line baking sheets with parchment paper. On a lightly floured work surface, using a lightly floured rolling pin, roll dough to 1/4-inch thickness. Using a 2-inch round or scalloped cookie cutter, quickly cut as many circles as possible and place cookies 1 inch apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used. Bake cookies, 1 sheet at a time, until they no longer look wet and are soft to the touch, 7 to 9 minutes; do not overbake. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare buttercream filling:</strong> In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Reduce speed to low and gradually add powdered sugar, scraping down sides of bowl as necessary. Add coffee and mix until blended (adding more, 1 teaspoon at a time, if necessary to reach desired consistency). Increase speed to high and beat until buttercream is creamy, about 2 minutes.</p>\n<p><strong>To assemble cookies:</strong> Spoon 1 teaspoon buttercream filling into center of bottom of a cookie. Top with another cookie, bottom side up as if making a sandwich, and gently press cookies together until filling spreads evenly to about 1/16-inch from edge. Repeat until all cookies form sandwiches.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/clareoes2009.jpg"},{"id":63,"name":"Kolaches","summary":"Meringue and fruit preserves put an added gloss on these pastry-style beauties.","baker":[{"name":"Pat Monson Johnson","hometown":"Eden Prairie"}],"features":["Fruit","International","Fun with kids"],"cookie_type":"Rolled","year":2009,"recipe_yield":"Makes about 5 dozen cookies.","ingredients_clean":"<ul>\n<li>4 cups flour, plus extra for rolling dough</li>\n<li>1 envelope (¼ ounce) active dry yeast</li>\n<li>2 cups (4 sticks) cold butter, cut into small pieces</li>\n<li>2 egg yolks</li>\n<li>1 cup sour cream</li>\n<li>3 egg whites</li>\n<li>1 cup granulated sugar</li>\n<li>About 2 cups apricot or raspberry preserves</li>\n<li>Powdered sugar for garnish</li>\n</ul>","procedure_clean":"<p><strong>To prepare pastry:</strong> In a large bowl, sift flour. Sprinkle yeast over flour. Using a pastry cutter or fork, cut butter into flour until mixture resembles coarse meal. Add egg yolks and sour cream and stir until well-combined (dough will be thick). Cover bowl with plastic wrap and refrigerate at least 4 hours, preferably overnight.</p>\n<p><strong>To prepare cookies:</strong> When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl of an electric mixer on medium-high speed, whip egg whites for 2 minutes. Slowly add granulated sugar, whipping egg whites to stiff, glossy (but not dry) peaks and reserve.</p>\n<p>On a lightly floured work surface, using a lightly floured rolling pin, roll 1 cup of cookie dough (keeping remaining dough in refrigerator so it remains firm) to thickness of pie crust, roughly 1/8- to 1/4-inch thick.</p>\n<p>Using a 3-inch cookie cutter or a pastry or pizza cutter, cut dough into 3-inch squares and place cookies 2 inches apart on prepared baking sheets. Repeat with remaining dough, gathering up scraps, re-rolling and cutting until all dough is used.</p>\n<p>Fill each square with ¾ teaspoon fruit preserves and one generous teaspoon of meringue. Pull corners of cookie into center and pinch gathered corners together tightly. Bake cookies, 1 sheet at a time, until pastry is golden brown (cookies will reopen during baking), about 25 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack placed over wax paper to cool completely. To garnish, fill a wire sieve with powdered sugar and gently tap out powdered sugar over cooled cookies.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/kolaches.jpeg"},{"id":64,"name":"Pistachio-Orange Cookies","summary":"2010 winner: A pretty – and pretty tasty – sandwich cookie.","baker":[{"name":"Scott Rohr","hometown":"Minneapolis"}],"features":["Winner","Fruit","Nut","Fun with kids"],"cookie_type":"Drop","year":2010,"recipe_yield":"Makes about 3 dozen sandwich cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>2 cups flour</li>\n<li>1 teaspoon salt</li>\n<li>2 teaspoons cream of tartar</li>\n<li>1 teaspoon baking soda</li>\n<li>1 cup (2 sticks) butter, at room temperature</li>\n<li>½ cup granulated sugar, plus extra for rolling dough</li>\n<li>½ cup firmly packed brown sugar</li>\n<li>1 egg</li>\n<li>1 teaspoon vanilla extract</li>\n</ul>\n<div><strong>For filling</strong></div>\n<ul>1 cup raw shelled pistachios, divided</li>\n<li>½ cup (1 stick) butter, at room temperature</li>\n<li>Freshly grated zest of 1 orange, finely chopped</li>\n<li>1 teaspoon orange extract</li>\n<li>1 teaspoon vanilla extract</li>\n<li>3 cups powdered sugar</li>\n<li>2 tablespoons milk (or use 1 tablespoon milk and 1 tablespoon freshly squeezed orange juice)</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a large bowl, whisk together flour, salt, cream of tartar and baking soda, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, granulated sugar and brown sugar until light and fluffy, about 2 minutes. Add egg and vanilla extract and beat until thoroughly combined. Reduce speed to low and add flour mixture, in thirds, mixing until just incorporated.</p>\n<p>Form dough into ½-inch balls (about the size of a chestnut). Roll dough balls in granulated sugar and place 2 inches apart on prepared baking sheets. Bake until cookies are set but not browned, about 11 minutes (cookies will puff up in oven, but flatten). Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare filling:</strong> In food processor fitted with a metal blade, pulse ½ cup pistachios until very fine (the nuts should almost clump together in a paste between your fingers).</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter with orange zest until light and fluffy. Add orange extract and vanilla extract and mix until thoroughly combined.</p>\n<p>Reduce speed to low and add powdered sugar, in thirds, alternating with milk (or milk and orange juice), beginning and ending with powdered sugar, and beat until smooth (you may need another tablespoon or so of liquid to reach desired consistency). Fold in pistachios, mixing until thoroughly incorporated.</p>\n<p><strong>To assemble cookies:</strong> Finely chop remaining ½ cup pistachios and place in a shallow dish. Spread a generous dollop of filling on bottom of a cookie. Top with another cookie, bottom-side up as if making a sandwich, and gently press cookies together until filling is just at edge of cookies. Roll filled edge in chopped pistachios. Repeat until all cookies form sandwiches.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-110147939.jpg"},{"id":65,"name":"Red Velvet Whoopie Pies","summary":"A Southern cake tradition, in bite-size form.","baker":[{"name":"Mike Burakowski","hometown":"Golden Valley"}],"features":["Chocolate","Fun with kids"],"cookie_type":"Drop","year":2010,"recipe_yield":"Makes about 5 dozen sandwich cookies.","ingredients_clean":"<div><strong>For cookies</strong></div>\n<ul>2 cups flour</li>\n<li>2 tablespoons unsweetened cocoa powder</li>\n<li>½ teaspoon baking soda</li>\n<li>¼ teaspoon salt</li>\n<li>½ cup (1 stick) butter, at room temperature</li>\n<li>1 cup firmly packed brown sugar</li>\n<li>1 egg</li>\n<li>1 teaspoon vanilla extract</li>\n<li>½ cup buttermilk</li>\n<li>1 (1-ounce) bottle red food coloring</li>\n</ul>\n<div><strong>For filling</strong></div>\n<ul>4 tablespoons (½ stick) butter, at room temperature</li>\n<li>4 ounces cream cheese</li>\n<li>1 (7-ounce) jar marshmallow creme</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>In a large bowl, whisk together flour, cocoa, baking soda and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter for 30 seconds. Add brown sugar and beat until light and fluffy, about 2 minutes. Add egg and vanilla extract, and mix until thoroughly combined. Reduce speed to low and add flour mixture, in thirds, alternating with buttermilk and beginning and ending with flour mixture. Stir in food coloring and mix well.</p>\n<p>Drop batter into 1-inch rounds about 1 inch apart on prepared baking sheets. Bake until tops are set, about 7 to 9 minutes. Remove from oven and cool cookies completely on baking sheets.</p>\n<p><strong>To prepare filling:</strong> In a bowl of an electric mixer on medium-high speed, beat butter and cream cheese until smooth. Add marshmallow creme and mix until thoroughly combined.</p>\n<p><strong>To assemble cookies:</strong> Spread a generous dollop of filling on the flat side of one cookie. Place the flat side of a second cookie against filling, as if making a sandwich. Press gently just until filling is at edge of cookies. Repeat with remaining cookies. Cover and refrigerate.</p>","notes":"Adapted from Southern Living magazine.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-110147144.jpg"},{"id":66,"name":"Strawberry Margarita Gems","summary":"Berries, lime and salt, minus the tequila.","baker":[{"name":"Lance Swanson","hometown":"North Branch"}],"features":["Fruit","International"],"cookie_type":"Rolled","year":2010,"recipe_yield":"Makes 3 to 4 dozen cookies.","ingredients_clean":"<div><strong>For filling</strong></div>\n<ul>1 pound frozen strawberries, thawed and chopped</li>\n<li>1 cup sugar</li>\n<li>1 teaspoon freshly squeezed lime juice</li>\n</ul>\n<div><strong>For cookies</strong></div>\n<ul>2¼ cups plus 2 tablespoons flour</li>\n<li>1 teaspoon baking powder</li>\n<li>¼ teaspoon salt</li>\n<li>1 cup (2 sticks) butter, at room temperature</li>\n<li>⅔ cup sugar, plus extra for rolling dough</li>\n<li>2 egg yolks</li>\n<li>Freshly grated zest from 1 lime</li>\n<li>2 teaspoons freshly squeezed lime juice</li>\n<li>Flaky sea salt or coarse kosher salt, for decorating</li>\n</ul>","procedure_clean":"<p><strong>To prepare strawberry filling:</strong> In a saucepan over medium heat, combine strawberries and sugar, and cook until mixture is reduced to 1 cup. Remove from heat, cool slightly and stir in lime juice. Transfer to a small bowl, cover and refrigerate overnight.</p>\n<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a large bowl, whisk together flour, baking powder and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter and sugar until light and fluffy, about 2 minutes. Add egg yolks, 1 at a time, beating well after each addition. Add lime zest and lime juice, and beat until thoroughly incorporated. Reduce speed to low and add flour mixture, in thirds, mixing until incorporated.</p>\n<p>Form dough into ¾-inch balls. Roll dough balls in sugar and place 1 inch apart on prepared baking sheets. Using your finger or a ½-teaspoon measuring spoon, make deep indentations in each cookie, pressing together any cracks that may form. Fill indentations with strawberry filling (you will not use all the filling). Bake until cookies are golden brown on bottom, 16 to 18 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely. Top each cookie with a few grains of sea salt or kosher salt.</p>","notes":"This recipe must be prepared in advance. Strawberry jam can be substituted for the strawberry filling.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-110144709.jpg"},{"id":67,"name":"Hot and Sassy Peanut Butter Buds","summary":"Chocolate, peanut butter and cayenne, oh my.","baker":[{"name":"Janet Heirigs","hometown":"Minneapolis"}],"features":["Chocolate","International"],"cookie_type":"Rolled","year":2010,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<ul>\n<li>1¼ cups flour</li>\n<li>1 teaspoon baking soda</li>\n<li>½ teaspoon salt</li>\n<li>¼ teaspoon plus 1/8 teaspoon cayenne pepper, divided</li>\n<li>¼ teaspoon freshly ground nutmeg</li>\n<li>2 tablespoons sesame seeds</li>\n<li>½ cup crunchy peanut butter, at room temperature</li>\n<li>⅓ cup (5 1/3 tablespoons) unsalted butter, at room temperature</li>\n<li>½ cup firmly packed brown sugar</li>\n<li>1 egg</li>\n<li>1 teaspoon vanilla extract</li>\n<li>¼ cup granulated sugar</li>\n<li>3 ounces dark chocolate bar infused with chile (see Taste Tip)</li>\n<li>¼ cup semisweet chocolate chips</li>\n<li>3 ounces white chocolate for decoration</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In medium bowl, whisk together flour, baking soda, salt, ¼ teaspoon cayenne pepper, nutmeg and sesame seeds, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat peanut butter and butter until creamy. Add brown sugar and beat until light and fluffy, about 2 minutes. Add egg and vanilla extract and mix until fully incorporated. Reduce speed to low, add flour mixture, a third at a time, until thoroughly combined. Cover and refrigerate overnight or up to two days.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, whisk together granulated sugar and remaining 1/8 teaspoon cayenne pepper. Form dough into 1-inch balls. Roll dough balls in sugar-cayenne pepper mixture and place 2 inches apart on prepared baking sheets.</p>\n<p>Bake until cookies are slightly browned, 10 to 12 minutes. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To assemble cookies:</strong> In a double boiler over simmering water, melt dark chocolate bar and chocolate chips. Dip tops of cooled cookies into melted chocolate and place on wax or parchment paper to set. In a double boiler over simmering water, melt white chocolate. Drizzle white chocolate over cookies.</p>","notes":"This dough must be prepared in advance. Two options for chocolate bars are Chuao Chocolatier's \"Spicy Maya\" or Lindt's \"Excellence Chili.\"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-110144239.jpg"},{"id":68,"name":"Nancy's Anise-Pecan Cookies","summary":"A surprise flavor in an easy cut-and-bake cookie.","baker":[{"name":"Mary Jane Nickerson","hometown":"Montevideo"}],"features":["Easy","Nut"],"cookie_type":"Refrigerator","year":2010,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<ul>\n<li>2½ cups flour, sifted</li>\n<li>1 teaspoon baking soda</li>\n<li>½ teaspoon salt</li>\n<li>½ teaspoon ground cloves</li>\n<li>½ teaspoon ground cinnamon</li>\n<li>1 tablespoon anise seeds</li>\n<li>1 cup (2 sticks) butter, at room temperature</li>\n<li>1 cup granulated sugar</li>\n<li>1 cup firmly packed brown sugar</li>\n<li>2 eggs</li>\n<li>½ cup finely chopped pecans</li>\n</ul>","procedure_clean":"<p>In a large bowl, whisk together flour, baking soda, salt, cloves, cinnamon and anise seeds, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, granulated sugar and brown sugar until light and fluffy, about 2 minutes. Add eggs, 1 at a time, beating well after each addition. Reduce speed to low and add flour mixture in thirds, mixing until combined. Stir in pecans. Divide dough in half and shape dough into two logs, each 10 inches long. Wrap logs in wax paper and refrigerate at least 4 hours or overnight.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Cut dough into ¼-inch thick cookies and place 2 inches apart on prepared baking sheets. Bake for 9 to 10 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-110143104.jpg"},{"id":69,"name":"Apple Cardamom Pecan Star Cookies","summary":"2015 winner: This cookie is reminiscent of apple or pecan pie.","baker":[{"name":"Jana Freiband","hometown":"Minneapolis"}],"features":["Winner","Fruit","Nut","International"],"cookie_type":"Rolled","year":2015,"recipe_yield":"Makes about 18 sandwich cookies.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>2 c. flour, plus extra for rolling dough</li>\n<li>1/2 tsp. baking powder</li>\n<li>2 tbsp. powdered sugar, plus more for decoration</li>\n<li>1/8 tsp. salt</li>\n<li>2 tsp. ground cinnamon</li>\n<li>2 tsp. ground cardamom</li>\n<li>3/4 c. pecans, toasted (see Note)</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>1/4 c. granulated sugar</li>\n<li>1 egg</li>\n<li>1 tsp. vanilla extract</li>\n<li>1/4 c. milk or water, as needed</li>\n</ul>\n<div><strong>For apple butter (see Note):</strong></div>\n<ul>\n<li>4 apples, peeled and sliced</li>\n<li>1/4 tsp. ground cinnamon</li>\n<li>1/4 tsp. ground nutmeg</li>\n<li>1/4 tsp. ground cardamom</li>\n<li>Pinch of ground cloves</li>\n<li>1/4 c. brown sugar</li>\n<li>1/2 tsp. freshly squeezed lemon juice</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a small bowl, whisk together flour, baking powder, powdered sugar, salt, 2 teaspoons cinnamon and 2 teaspoons cardamom. Set aside.</p>\n<p>In a bowl of a food processor fitted with a metal blade, pulse pecans until nuts are very finely ground. Whisk into flour mixture.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter and granulated sugar until light and fluffy, about 2 minutes. Add egg and vanilla extract, and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix just until combined and dough forms, adding enough milk or water to make dough pliable. Form dough into a disc, wrap in plastic wrap and refrigerate until firm, at least 2 hours.</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>On a lightly floured surface, using a lightly floured rolling pin, roll dough to 1/8-inch thickness. Use a star-shaped cutter (about 3 to 4 inches) to cut cookies from dough, and use a smaller star-shaped cutter (about 1 to 2 inches) to cut shapes out of the center of half of the cookies. Repeat with remaining dough, gathering up scraps, rerolling and cutting until all dough is used.</p>\n<p>Place dough 1 inch apart on prepared baking sheets. Bake until cookies begin to brown and dough is just set, about 8 to 10 minutes. Remove from oven, cool 2 minutes and transfer cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare filling:</strong> In a saucepan over low heat, combine apples, 1/4 teaspoon cinnamon, nutmeg, 1/4 teaspoon cardamom, cloves, brown sugar and lemon juice, and cook until apples are soft and can be easily mashed, about 30 to 45 minutes. Pass mixture through a food mill (or pulse in a food processor fitted with a metal blade) to a smooth consistency. You should have about 1/2 cup apple butter.</p>\n<p>Add a small teaspoonful of apple butter to the center of a bottom cookie and form a sandwich with a cutout cookie. Repeat with remaining cookies. Dust with powdered sugar, if desired.</p>","notes":"This recipe must be prepared in advance. Commercially prepared apple butter is readily available. To toast pecans, place nuts in a dry skillet over medium heat, and cook, stirring (or shaking the pan frequently) until they just begin to release their fragrance, about 3 to 5 minutes (alternately, preheat oven to 325 degrees, spread nuts on an ungreased baking sheet and bake, stirring often, for 4 to 6 minutes). Remove from heat and cool to room temperature.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-360034701.jpg"},{"id":70,"name":"Chocolate Decadence Cookies","summary":"Fragrant, fudge-like and yes, decadent.","baker":[{"name":"Elaine Prebonich","hometown":"New Brighton"}],"features":["Easy","Chocolate","Nut"],"cookie_type":"Drop","year":2015,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<ul>\n<li>2 eggs</li>\n<li>1/2 c. sugar</li>\n<li>1 tsp. vanilla extract</li>\n<li>1/4 c. flour</li>\n<li>1/4 tsp. baking powder</li>\n<li>1/8 tsp. salt</li>\n<li>8 oz. bittersweet chocolate, coarsely chopped</li>\n<li>2 tbsp. unsalted butter</li>\n<li>1 1/2 c. coarsely chopped walnuts (toasted, if desired; see Note)</li>\n<li>6 oz. semisweet chocolate chips</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a small bowl, whisk together eggs, sugar and vanilla extract. Set bowl in a larger bowl of hot tap water.</p>\n<p>In a small bowl, whisk together flour, baking powder and salt.</p>\n<p>In a double boiler over gently simmering water, combine bittersweet chocolate and butter, and stir until melted and smooth. Remove from heat and stir in egg mixture, mixing until thoroughly combined. Stir in flour mixture. Stir in walnuts and chocolate chips.</p>\n<p>Drop slightly rounded tablespoons of batter 2 inches apart on prepared baking sheets. Bake until surface looks dry and centers are still gooey, about 10 minutes. Remove from oven, cool 2 minutes and transfer cookies to a wire rack to cool completely.</p>","notes":"For added flavor, we toasted the walnuts. To toast walnuts, place nuts in a dry skillet over medium heat, and cook, stirring (or shaking the pan frequently) until they just begin to release their fragrance, about 3 to 4 minutes (alternately, preheat oven to 325 degrees, spread nuts on an ungreased baking sheet and bake, stirring often, for 4 to 6 minutes).","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/ows_144907443275913.jpg"},{"id":71,"name":"Cardamom Orange Zest Cookies","summary":"A Christmas cookie that tastes like the holidays.","baker":[{"name":"Jeanne Nordstrom","hometown":"St. Paul"}],"features":["Easy","Fruit","International"],"cookie_type":"Drop","year":2015,"recipe_yield":"Cardamom Orange Zest Sugar Cookies","ingredients_clean":"<div><strong>For dough:</strong></div>\n<ul>\n<li>2 c. plus 2 tbsp. flour</li>\n<li>1/2 tsp. salt</li>\n<li>1/2 tsp. baking soda</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>1/2 c. granulated sugar</li>\n<li>1/2 c. powdered sugar</li>\n<li>1/2 c. canola oil</li>\n<li>1 egg</li>\n<li>1/2 tsp. vanilla extract</li>\n<li>Freshly grated zest from 2 oranges</li>\n<li>1 tsp. ground cardamom</li>\n</ul>\n<div><strong>For decoration:</strong></div>\n<ul>\n<li>1 1/2 tbsp. granulated sugar</li>\n<li>1/2 tsp. ground cardamom</li>\n<li>1 tbsp. unsalted butter, at room temperature</li>\n<li>Freshly grated zest from 1 orange, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a medium bowl, whisk together flour, salt and baking soda.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat 1/2 cup butter, 1/2 cup granulated sugar and powdered sugar until light and fluffy, about 2 minutes. Add canola oil, egg, vanilla extract, zest from 2 oranges and 1 teaspoon cardamom, and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Cover bowl with plastic wrap and refrigerate for at least 1 hour.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Shape dough into 1-inch balls. Place dough 2 inches apart on prepared baking sheets.</p>\n<p><strong>To decorate cookies:</strong> In a small bowl, stir together 1 1/2 tablespoons granulated sugar and 1/2 teaspoon cardamom. Grease bottom of a flat-bottomed glass with butter and dip in sugar-cardamom mixture, then press down cookies. Repeat with remaining cookies. Bake until bottoms are golden brown, about 10 to 12 minutes. Remove from oven, cool 2 minutes and transfer cookies to a wire rack to cool completely. Sprinkle with orange zest, if desired.</p>","notes":"This recipe must be prepared in advance. As the cookies cooled, we decorated with freshly grated orange zest, for additional flavor and color.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-360041561.jpg"},{"id":73,"name":"Kit Kat Christmas Bars","summary":"Super easy and super tasty chocolate bars.","baker":[{"name":"Julie Olson","hometown":"East Bethel"}],"features":["Easy","Chocolate","Fun with kids"],"cookie_type":"Bar","year":2015,"recipe_yield":"Makes about 3 dozen cookie bars.","ingredients_clean":"<ul>\n<li>1 c. (2 sticks) unsalted butter</li>\n<li>1/2 c. milk</li>\n<li>1/3 c. granulated sugar</li>\n<li>1 c. brown sugar, packed</li>\n<li>2 c. crushed graham crackers</li>\n<li>1 (13.7 oz.) box Keebler Club Crackers</li>\n<li>1/2 c. semisweet chocolate chips</li>\n<li>1/2 c. butterscotch chips</li>\n<li>1/3 c. peanut butter</li>\n<li>Chopped dry-roasted, unsalted nuts or decorative sugars, optional</li>\n</ul>","procedure_clean":"<p>In a saucepan over medium heat, combine butter, milk, granulated sugar, brown sugar and graham crackers. Bring to a boil and stir continuously for 5 minutes; do not allow mixture to burn. Remove from heat.</p>\n<p>Layer the bottom of a 9- by 13-inch pan with Club Crackers. Pour half of hot mixture over Club Crackers. Add a second layer of Club Crackers over mixture. Pour remaining half of hot mixture over the second layer of Club Crackers. Add a third layer of Club Crackers. Refrigerate until set.</p>\n<p>When bars are set, combine chocolate chips, butterscotch chips and peanut butter in a microwave-safe bowl. Cook mixture, stirring occasionally, until fully melted and stir until smooth. Pour melted topping over top layer of Club Crackers and spread evenly across bars.</p>\n<p>Sprinkle with chopped peanuts or decorative sugars, if desired. Allow topping to cool. Cut into squares and serve.</p>","notes":"We decorated with dry-roasted, unsalted peanuts, to alert eaters with food allergies that the bar cookies contained peanuts. Natural peanut butter (no sugar added) really works well for these cookies.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-360040241.jpg"},{"id":74,"name":"Italian Almond Cookies","summary":"2014 winner: Deceptively distinctive, with a festive hint of lemon.","baker":[{"name":"William Teresa","hometown":"Minneapolis"}],"features":["Winner","Easy","Fruit","Nut","International"],"cookie_type":"Refrigerator","year":2014,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<ul>\n<li>1 egg white</li>\n<li>2 1/4 c. almond flour</li>\n<li>3/4 c. granulated sugar</li>\n<li>Zest of 1 large lemon</li>\n<li>1/2 tsp. honey</li>\n<li>1 tsp. almond extract</li>\n<li>1 tsp. vanilla extract</li>\n<li>Powdered sugar, for coating</li>\n</ul>","procedure_clean":"<p>Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a bowl of an electric mixer on medium-high speed (or using a whisk and beating by hand), beat egg white until soft peaks form.</p>\n<p>In a medium bowl, whisk together almond flour, granulated sugar and lemon zest. Stir in beaten egg white, honey, almond extract and vanilla extract, and knead into a ball of dough (dough will be slightly sticky). Roll dough into a 1-inch thick log. Using a sharp knife, cut log at 1/2-inch intervals and form dough into egg-shaped cookies.</p>\n<p>Fill a shallow bowl with powdered sugar. Roll cookies in powdered sugar, coating all sides and gently tapping off excess powdered sugar.</p>\n<p>Place cookies 1 inch apart on prepared baking sheets (cookies spread only slightly) and bake until only slightly browned with a cracked exterior, about 15 to 20 minutes. Do not overbake. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>","notes":"“These are not quite traditional Ricciarelli [pronounced REACH-a-RELL-ee], and nothing can replace the context of a loving Italian family,” Teresa wrote in his entry. “But I think these are some of the tastiest cookies I’ve ever had. Almost every person who’s tried them — and there have been many — has asked for the recipe, so I thought you might like it too.” Almond flour (or blanched almond meal) is available in the specialty flours section of most supermarkets.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-284646961.jpg"},{"id":75,"name":"Espresso-Hazelnut Truffle Cookies","summary":"Layers of chocolate, coffee and crunch.","baker":[{"name":"Cheryl Francke","hometown":"Arden Hills"}],"features":["Chocolate","Nut"],"cookie_type":"Drop","year":2015,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>4 oz. unsweetened chocolate</li>\n<li>1 1/4 c. semisweet mini chocolate chips, divided</li>\n<li>2 tsp. instant espresso powder</li>\n<li>1/3 c. (5 1/3 tbsp.) unsalted butter, at room temperature</li>\n<li>3/4 c. flour</li>\n<li>2 tbsp. unsweetened cocoa powder</li>\n<li>1/4 tsp. baking powder</li>\n<li>1/4 tsp. salt</li>\n<li>1 c. sugar</li>\n<li>3 eggs</li>\n<li>1/4 c. finely chopped hazelnuts</li>\n</ul>\n<div><strong>For glaze:</strong></div>\n<ul>\n<li>1/3 c. semisweet mini chocolate chips</li>\n<li>1 tbsp. vegetable oil</li>\n<li>1/4 c. finely chopped hazelnuts</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a double boiler over gently simmering water (or in a bowl in a microwave oven), melt unsweetened chocolate, 1 cup semisweet mini chocolate chips, instant espresso powder and butter, and stir to combine. Cool for 10 minutes.</p>\n<p>In a medium bowl, whisk together flour, cocoa, baking powder and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat sugar and eggs until light and fluffy, about 2 minutes. Add chocolate mixture and mix until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated. Stir in hazelnuts and remaining 1/4 cup semisweet mini chocolate chips. Cover and refrigerate at least 6 hours or overnight.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>Roll dough into 1-inch balls. Place dough 2 inches apart on prepared baking sheets, flattening dough slightly. Bake until lightly puffed and just set, about 9 to 11 minutes. Remove from oven and cool for 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare glaze:</strong> In a double boiler over gently simmering water (or in a bowl in a microwave oven), melt 1/3 cup semisweet mini chocolate chips and vegetable oil, and stir to combine. Drizzle chocolate over cooled cookies; sprinkle chopped hazelnuts over chocolate glaze. Allow glaze to set.</p>","notes":"This recipe must be prepared in advance. Francke prefers to include 1 1/2 teaspoon brewed coffee to the dough when the chocolate mixture is added.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-284649121.jpg"},{"id":76,"name":"Macadamia Nut Tarts","summary":"Step outside the holiday-baking comfort zone.","baker":[{"name":"Trish Cowle","hometown":"Mendota Heights"}],"features":["Fruit","Nut"],"cookie_type":"Rolled","year":2014,"recipe_yield":"Makes about 4 dozen cookies.","ingredients_clean":"<div><strong>For crust:</strong></div>\n<ul>\n<li>3 c. flour, plus extra for rolling dough</li>\n<li>1/2 c. cornstarch</li>\n<li>1/2 tsp. salt</li>\n<li>1 1/2 c. (3 sticks) unsalted butter, at room temperature, plus extra for tart pans</li>\n<li>2/3 c. granulated sugar</li>\n<li>Dried lemon zest from 1 large lemon (see Note)</li>\n</ul>\n<div><strong>For topping:</strong></div>\n<ul>\n<li>10 tbsp. (1 stick plus 2 tbsp.) unsalted butter</li>\n<li>1/2 c. firmly packed brown sugar</li>\n<li>1/3 c. granulated sugar</li>\n<li>2 1/2 tbsp. heavy cream</li>\n<li>3 c. macadamia nuts, coarsely chopped</li>\n</ul>","procedure_clean":"<p><strong>To prepare crust:</strong> Preheat oven to 350 degrees, and grease tart or mini-muffin pans.</p>\n<p>In a medium bowl, whisk together flour, cornstarch and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter, 2/3 cup granulated sugar and lemon peel until light and fluffy, about 2 minutes. Reduce speed to low, add flour mixture and mix just until dough is crumbly.</p>\n<p>On a lightly floured surface and using a lightly floured rolling pin, roll out dough to 3/8-inch thickness. Using a 2- or 3-inch biscuit cutter (depending upon the size of mini-muffin pan or mini-tart pan), cut out dough and transfer to prepared pans, pressing into pan and leaving a well in the center (or form dough into a ball, press dough into pans and form desired shape). Prick dough with fork and bake until light brown, about 16 to 18 minutes. Remove from oven and cool cookies in pans for 10 minutes, then turn cookies onto a wire rack to cool completely.</p>\n<p><strong>To prepare topping:</strong> In a medium saucepan over medium heat, combine 10 tablespoons butter, brown sugar and 1/3 cup granulated sugar, and cook, stirring constantly, until mixture comes to a boil. When mixture comes to a boil, cook for 1 additional minute, until mixture thickens and large bubbles begin to form. Remove from heat and stir in cream and nuts. Spoon 1 to 2 tablespoons (depending upon pan size) into each tart crust and cool completely.</p>","notes":"This recipe must be prepared in advance. Cowle encountered this recipe in “The Spirit of Christmas.” To prepare dried lemon zest, spread the zest of 1 large lemon on wax paper and allow to air-dry overnight (dried lemon zest is also available in the spice aisle at some supermarkets). Other nuts can be used as a substitute for macadamia nuts.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-284648911.jpg"},{"id":77,"name":"Tart and Sassy Cranberry Lemon Drops","summary":"They taste as good as they look.","baker":[{"name":"Janet Heirigs","hometown":"Minneapolis"}],"features":["Fruit","Nut","Fun with kids"],"cookie_type":"Refrigerator","year":2014,"recipe_yield":"Makes about 3 dozen cookies.","ingredients_clean":"<div><strong>For dough:</strong></div>\n<ul>\n<li>3/4 c. granulated sugar</li>\n<li>Zest from 2 large lemons</li>\n<li>1/2 c. dried cranberries</li>\n<li>1/2 c. toasted pecans (see Note)</li>\n<li>1 3/4 c. flour</li>\n<li>1/4 tsp. salt</li>\n<li>1/4 tsp. baking powder</li>\n<li>12 tbsp. (1 1/2 sticks) very cold unsalted butter, cut into 1/2-in. cubes</li>\n<li>1 egg yolk</li>\n<li>2 tbsp. freshly squeezed lemon juice</li>\n<li>1/2 tsp. vanilla extract</li>\n</ul>\n<div><strong>For icing:</strong></div>\n<ul>\n<li>1 tbsp. cream cheese, at room temperature</li>\n<li>1 tbsp. unsalted butter, at room temperature</li>\n<li>1 1/2 c. powdered sugar</li>\n<li>1/4 tsp. vanilla extract</li>\n<li>Zest from 1 lemon</li>\n<li>1 to 2 tbsp. freshly squeezed lemon juice</li>\n<li>Dried cranberries</li>\n<li>15 lemon drop candies, crushed</li>\n</ul>","procedure_clean":"<p><strong>To prepare dough:</strong> In food processor fitted with a metal blade, combine granulated sugar, zest from 2 lemons and 1/2 cup dried cranberries, and process until thoroughly incorporated, about 30 to 45 seconds. Add pecans and process an additional 15 seconds.</p>\n<p>In a medium bowl, whisk together flour, salt and baking powder. Add flour mixture to sugar mixture and combine with 10 (1-second) pulses. Scatter cold butter pieces on top of sugar-flour mixture and pulse for 15 (1-second) pulses.</p>\n<p>In a small bowl, whisk together egg yolk, 2 tablespoons lemon juice and 1/2 teaspoon vanilla extract. With food processor running, add egg mixture in a slow, steady stream, until dough begins to form into a ball, about 10 to 15 seconds.</p>\n<p>Remove dough from food processor and divide in half. Place both balls of dough between sheets of parchment paper or plastic wrap and roll dough into 1 1/2-inch-thick logs. Refrigerate for at least 2 hours.</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper.</p>\n<p>Slice dough into rounds about 3/8-inch thick. Place cookies 1 inch apart on prepared baking sheets and bake until centers of cookies begin to color and edges are a light golden brown, about 13 to 16 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium speed, combine cream cheese, 1 tablespoon butter, powdered sugar, 1/4 teaspoon vanilla extract, zest from 1 lemon and 1 tablespoon lemon juice (adding more, if necessary, 1 teaspoon at a time) and mix until smooth. Transfer icing to a piping bag fitted with a small tip. Squeeze about 1/2 teaspoon of icing onto the center of the cookie, top with 2 to 3 dried cranberries and sprinkle tops of cookies with crushed lemon drops.</p>","notes":"This recipe must be prepared in advance. To toast pecans, preheat oven to 325 degrees. Spread nuts on an ungreased baking sheet and bake for 5 to 7 minutes, stirring often. Remove from oven and cool.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-284648301.jpg"},{"id":78,"name":"Chocolate Peppermint Cookies","summary":"A new holiday favorite for kids of all ages.","baker":[{"name":"Karen Evans","hometown":"Minneapolis"}],"features":["Easy","Chocolate","Fun with kids"],"cookie_type":"Drop","year":2014,"recipe_yield":"Makes about 2 dozen cookies.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>1 1/2 c. flour</li>\n<li>1/2 c. unsweetened cocoa powder</li>\n<li>1/4 tsp. salt</li>\n<li>1/4 tsp. baking powder</li>\n<li>1/4 tsp. baking soda</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>1 c. granulated sugar</li>\n<li>1 egg</li>\n<li>1 1/2 tsp. vanilla extract</li>\n</ul>\n<div><strong>For topping:</strong></div>\n<ul>\n<li>3 tbsp. butter, at room temperature</li>\n<li>2 c. powdered sugar</li>\n<li>1 tsp. peppermint extract</li>\n<li>1 to 3 tbsp. milk (or heavy cream)</li>\n<li>1/3 c. crushed hard peppermint candies (such as candy canes)</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a medium bowl, whisk together flour, cocoa, salt, baking powder and baking soda, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat 1/2 cup butter until creamy, about 1 minute. Add granulated sugar and beat until light and fluffy, about 2 minutes. Add egg and vanilla extract, and beat until thoroughly combined. Reduce speed to low, add flour mixture and mix until just incorporated.</p>\n<p>Roll dough into 1-inch balls. Place dough 2 inches apart on prepared baking sheets, flattening dough slightly. Bake until cookies are set and dry-looking, about 10 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare topping:</strong> In a bowl of an electric mixer on medium speed, combine 3 tablespoons butter and powdered sugar, and beat until creamy. Add peppermint extract and enough milk (or cream), 1 tablespoon at a time, and mix until smooth.</p>\n<p>Spread icing across the top of each cookie, then press iced cookies into crushed peppermint candies.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-284648511.jpg"},{"id":79,"name":"Hot Cocoa Cookies","summary":"All the elements of a cup of hot chocolate.","baker":[{"name":"Macy Hennen","hometown":"Pierz"}],"features":["Chocolate","Fun with kids"],"cookie_type":"Rolled","year":2013,"recipe_yield":"Makes 2 to 3 dozen.","ingredients_clean":"<ul>\n<li>1 1/2 c. flour</li>\n<li>1/4 c. unsweetened cocoa powder</li>\n<li>1 1/2 tsp. baking powder</li>\n<li>1/4 tsp. salt</li>\n<li>16 oz. semisweet chocolate, divided</li>\n<li>1/2 c. (1 stick) unsalted butter</li>\n<li>1 1/4 c. light brown sugar</li>\n<li>3 eggs</li>\n<li>1 1/2 tsp. vanilla extract</li>\n<li>30 regular marshmallows or 90 mini-marshmallows</li>\n</ul>","procedure_clean":"<p>In a large bowl, whisk together flour, cocoa powder, baking powder and salt, and reserve.</p>\n<p>Chop 12 ounces of semisweet chocolate into 1/2-inch pieces. In a double boiler over gently simmering water, melt butter and chopped chocolate, whisking frequently, until smooth. Remove from heat and cool 15 minutes.</p>\n<p>In a bowl of an electric mixer on medium speed, beat brown sugar, eggs and vanilla extract until smooth, about 2 minutes. Add melted chocolate mixture and mix until just blended. Reduce speed to low and add flour mixture in 2 batches, mixing until just combined. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>When ready to bake, preheat oven to 325 degrees and line baking sheets with parchment paper. Break remaining 4 ounces of chocolate into small pieces, and cut marshmallows (if necessary) into a size suitable for the top of the cookie.</p>\n<p>Roll dough into 1-inch balls. Place dough 2 inches apart on prepared baking sheets, flattening dough slightly. Bake until tops of cookies crack, about 12 minutes. Remove from oven and gently press a chocolate piece, then a marshmallow (or 3 minis), onto each cookie. Return cookies to oven and bake until marshmallows are just softened, about 4 minutes. Remove from oven and cool 5 minutes before transferring cookies to a wire rack. Grate remaining chocolate over warm cookies as a garnish.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-234396661.jpg"},{"id":80,"name":"Cinnamon Bun Cookies","summary":"The cookie version of a favorite morning wake-up call.","baker":[{"name":"Patrice Hurd","hometown":"Bemidji"}],"features":["Fun with kids"],"cookie_type":"Refrigerator","year":2013,"recipe_yield":"Makes 3 to 4 dozen.","ingredients_clean":"<div><strong>For dough:</strong></div>\n<ul>\n<li>3 c. flour</li>\n<li>1 tsp. baking powder</li>\n<li>1 tsp. baking soda</li>\n<li>1/2 tsp. salt</li>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>2 tbsp. (1 oz.) cream cheese, at room temperature</li>\n<li>1 c. powdered sugar</li>\n<li>1 egg</li>\n<li>2 tsp. vanilla extract</li>\n</ul>\n<div><strong>For filling:</strong></div>\n<ul>\n<li>6 tbsp. (3/4 stick) unsalted butter, at room temperature</li>\n<li>3/4 c. dark brown sugar, packed</li>\n<li>1 tbsp. ground cinnamon</li>\n<li>1/8 tsp. salt</li>\n</ul>\n<div><strong>For icing:</strong></div>\n<ul>\n<li>6 tbsp. (3/4 stick) unsalted butter, at room temperature</li>\n<li>1/4 c. (2 oz.) cream cheese, at room temperature</li>\n<li>Pinch of salt</li>\n<li>1/2 tsp. vanilla extract</li>\n<li>1/4 tsp. almond extract</li>\n<li>2 c. powdered sugar</li>\n</ul>","procedure_clean":"<p><strong>To prepare dough:</strong> In a large bowl, whisk together flour, baking powder, baking soda and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter and cream cheese until creamy, about 1 minute. Reduce speed to low, add powdered sugar and mix until light and fluffy. Add egg and vanilla extract, and mix until thoroughly incorporated. Gradually add flour mixture, mixing just until a smooth dough is formed. Divide dough into 2 equal pieces and flatten into disks, cover in plastic wrap and refrigerate while preparing filling.</p>\n<p><strong>To prepare filling:</strong> In a bowl of an electric mixer on medium speed, beat butter, brown sugar, cinnamon and salt until smooth.</p>\n<p>Remove 1 dough disk and place between 2 large pieces of parchment or wax paper. Roll dough to a 9- by 12-inch rectangle (lifting top piece of paper and piecing/re-rolling dough as necessary) then remove top paper. Dot teaspoon-size pieces of filling over half of dough (using half of filling) and use the back of a spoon to evenly spread filling across top of dough. Beginning with 1 long edge, gently roll up dough, peeling away bottom layer of parchment or wax paper and taking care not to allow cracks in dough to appear.</p>\n<p>Place dough seam-side down (and gently stretch from center outward to form a 12-inch long roll, if necessary). Using a sharp knife, cut roll in half. Wrap dough logs in plastic wrap and refrigerate at least 2 hours or overnight. Repeat with remaining dough and filling (dough may be covered well and frozen; thaw in refrigerator before baking).</p>\n<p>When ready to bake, preheat oven to 375 degrees and line baking sheets with parchment paper. Unwrap dough logs and, using a sharp knife, trim off uneven ends. Cut dough into 1/2-inch slices and place cookies 2 inches apart on prepared baking sheets. Bake until cookies are just set and edges barely begin to brown, about 8 to 9 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> Meanwhile, while cookies are in the oven, combine butter, cream cheese, salt, vanilla extract and almond extract in the bowl of an electric mixer on medium-high speed. Beat until creamy, about 1 minute. Reduce speed to low, add powdered sugar and mix until smooth.</p>\n<p>When cookies are still warm, top each cookie with about 1 1/2 teaspoons icing, and gently spread icing across top of cookie (or fill a pastry bag fitted with a small tip and pipe icing over cookies). Cool cookies completely, then refrigerate until icing sets. Store cookies in a tightly covered container in the refrigerator, and serve at room temperature.</p>","notes":"This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/ows_138616180723459.jpg"},{"id":81,"name":"Orange-Almond Melting Moments","summary":"Pretty, versatile and yes, mouth-melting.","baker":[{"name":"Patrice Johnson","hometown":"Roseville"}],"features":["Fruit","Nut","International"],"cookie_type":"Rolled","year":2013,"recipe_yield":"Makes about 2 dozen.","ingredients_clean":"<div><strong>For dough:</strong></div>\n<ul>\n<li>1 c. flour</li>\n<li>2/3 c. cornstarch</li>\n<li>1/4 tsp. ground chipotle pepper (see Note)</li>\n<li>1/4 tsp. salt</li>\n<li>1 c. (2 sticks) unsalted butter, cut into tablespoons, at room temperature</li>\n<li>1/3 c. powdered sugar</li>\n<li>Freshly grated zest of 1 orange</li>\n<li>1/2 tsp. almond extract</li>\n</ul>\n<div><strong>For icing:</strong></div>\n<ul>\n<li>3 tbsp. freshly squeezed orange juice</li>\n<li>1 tbsp. unsalted butter, at room temperature</li>\n<li>1 tsp. almond extract</li>\n<li>1 tsp. vanilla extract</li>\n<li>1/4 tsp. salt</li>\n<li>2 3/4 c. powdered sugar</li>\n<li>1/2 c. raw sliced almonds for garnish</li>\n<li>Freshly grated orange zest for garnish, optional</li>\n</ul>","procedure_clean":"<p><strong>To prepare dough:</strong> In a large bowl, whisk together flour, cornstarch, ground chipotle pepper and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add powdered sugar, orange zest and almond extract, and beat until light and fluffy, about 2 minutes. Reduce speed to low, add flour mixture and mix until a grainy dough forms. Use hands to shape dough into a round ball. Wrap dough in plastic wrap and refrigerate for 30 to 60 minutes.</p>\n<p>When ready to bake, preheat oven to 325 degrees and line baking sheets with parchment paper. Roll dough into tablespoon-sized balls and place 2 inches apart on prepared baking sheets. Bake 12 to 14 minutes (cookies will be very light-colored); do not overbake. Remove from oven and cool 5 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium speed, beat orange juice, butter, almond extract, vanilla extract and salt until creamy. Reduce speed to low, add powdered sugar and mix until smooth. Using a small spatula or knife (or a pastry bag), ice cookies. For a less sweet cookie, use only 1 teaspoon icing; for a sweeter cookie, ice liberally. Garnish with almonds and orange zest, if desired.</p>","notes":"Ground chipotle pepper is available at most supermarkets. This dough must be prepared in advance.","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/ows_138616182879378.jpg"},{"id":82,"name":"Cappuccino Flats","summary":"2013 winner: A harmonious combination of chocolate and coffee.","baker":[{"name":"Dianne Sivald","hometown":"White Bear Lake"}],"features":["Winner","Easy","Chocolate"],"cookie_type":"Refrigerator","year":2013,"recipe_yield":"Makes about 4 dozen.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>2 c. flour</li>\n<li>1 tsp. ground cinnamon</li>\n<li>1/4 tsp. salt</li>\n<li>2 oz. unsweetened chocolate</li>\n<li>1 tbsp. instant coffee crystals (see Note)</li>\n<li>1 tsp. water</li>\n<li>1 c. (2 sticks) unsalted butter, at room temperature</li>\n<li>1/2 c. sugar</li>\n<li>1/2 c. brown sugar, packed</li>\n<li>1 egg</li>\n</ul>\n<div><strong>For icing:</strong></div>\n<ul>\n<li>1 1/2 c. semisweet chocolate pieces</li>\n<li>3 tbsp. shortening</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> In a large bowl, whisk together flour, cinnamon and salt, and reserve.</p>\n<p>In a double-boiler over gently simmering water (or in a microwave oven), melt unsweetened chocolate. Remove from heat and cool slightly.</p>\n<p>In a small bowl, combine coffee crystals and 1 teaspoon water, and stir until dissolved.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and brown sugar, and beat until light and fluffy, about 2 minutes. Add melted chocolate, coffee mixture and egg, and beat until thoroughly combined.</p>\n<p>Reduce speed to low, add flour mixture and mix until just incorporated. Cover with plastic wrap and refrigerate at least 1 hour.</p>\n<p>When dough is easy to handle, divide in half and shape into logs about 7 inches long and 1 inch in diameter. Wrap dough logs in plastic wrap and refrigerate at least 6 hours or overnight.</p>\n<p>When ready to bake, preheat oven to 350 degrees and line baking sheets with parchment paper. Unwrap dough and, using a sharp knife, trim off uneven ends. Cut dough into 1/4-inch slices and place cookies 1 inch apart on prepared baking sheets. Bake until edges are firm and lightly browned, about 10 to 12 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a double boiler over gently simmering water (or in a microwave oven), melt semisweet chocolate and shortening, whisking to combine. Remove from heat and let mixture cool for a few minutes. Dip one half of each cookie into chocolate mixture, sliding the back of the cookie on the edge of the pan to remove excess chocolate. Place cookies on wax paper until chocolate sets.</p>","notes":"This dough must be prepared in advance. We prefer using instant espresso coffee (such as the Medaglia D’oro brand, available at most supermarkets) instead of instant coffee crystals. Recipe adapted from “Cookies for Christmas” (Better Homes and Gardens Books).","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/cookieThumb-234395801.jpg"},{"id":83,"name":"Candy Cane Sugar Cookies","summary":"The colorful bite of cool peppermint.","baker":[{"name":"Michelle Mazzara","hometown":"Eagan"}],"features":["Fun with kids"],"cookie_type":"Drop","year":2013,"recipe_yield":"Makes about 4 dozen.","ingredients_clean":"<div><strong>For cookies:</strong></div>\n<ul>\n<li>2 1/2 c. flour</li>\n<li>1 tsp. baking soda</li>\n<li>1/2 tsp. cream of tartar</li>\n<li>1/4 tsp. salt</li>\n<li>1 c. (2 sticks) unsalted butter, at room temperature</li>\n<li>1 1/4 c. sugar</li>\n<li>3 egg yolks</li>\n<li>1 tsp. vanilla extract</li>\n<li>1 tsp. peppermint extract</li>\n<li>1 c. (about 6 oz.) crushed candy canes or peppermint hard candies</li>\n</ul>\n<div><strong>For icing:</strong></div>\n<ul>\n<li>1/2 c. (1 stick) unsalted butter, at room temperature</li>\n<li>4 oz. cream cheese, at room temperature</li>\n<li>1 tsp. peppermint extract</li>\n<li>2 c. powdered sugar</li>\n<li>1/8 tsp. salt</li>\n<li>2 drops red food coloring</li>\n</ul>","procedure_clean":"<p><strong>To prepare cookies:</strong> Preheat oven to 350 degrees and line baking sheets with parchment paper.</p>\n<p>In a large bowl, whisk together flour, baking soda, cream of tartar and salt, and reserve.</p>\n<p>In a bowl of an electric mixer on medium-high speed, beat butter until creamy, about 1 minute. Add sugar and beat until light and fluffy, about 2 minutes. Add egg yolks, 1 at a time, beating well after each addition. Add vanilla extract and peppermint extract, and beat until well incorporated.</p>\n<p>Reduce speed to low, add flour mixture and mix until just incorporated. Stir in candy pieces.</p>\n<p>Drop tablespoon-sized cookies 2 inches apart on prepared baking sheets, and bake until tops are cracked and lightly browned, about 11 to 13 minutes. Remove from oven and cool 2 minutes before transferring cookies to a wire rack to cool completely.</p>\n<p><strong>To prepare icing:</strong> In a bowl of an electric mixer on medium speed, combine butter, cream cheese and peppermint extract, and beat until creamy. Reduce speed to low, add powdered sugar and salt, and mix until creamy. Add food coloring, 1 drop at a time, to reach desired color. Drizzle or spread icing on cookies.</p>","notes":"","baker_bio_notes":"","thumbnail":"https://static.startribune.com/news/projects/all/20191106-cookie-wars/media/recipes/ows_138616183758253.jpg"}]
